Repository: grumpycoders/pcsx-redux
Catalog: i18n/*.po
Languages: es_es, fr, pt_br, uk

source: When combining two instructions into a single pseudo-instruction, add a placeholder for the second one.
es_es: Al combinar dos instrucciones en una seudoinstrucción, se añadirá un marcador de posición para la segunda.
fr: En combinant deux instructions en une seule pseudo-instruction, ajouter un espace réservé pour la seconde.
pt_br: Quando combinar duas instruções em uma única pseudo-instrução, adicione um espaço reservado para a segunda.
uk: При об'єднанні двох указівок до однієї псевдовказівки додай заповнювач для другої.

source: Delay slot notch
es_es: Marca de ranura de retraso
pt_br: Entalhe do slot de atraso
uk: Позначка слота затримки

source: Add a small visible notch to indicate instructions that are on the delay slot of a branch.
es_es: Añade una pequeña marca visible para indicar a las instrucciones que se encuentran en la ranura de retraso de una rama.
fr: Ajouter une marque visible pour indiquer les instructions qui se trouvent à l'emplacement d'un Delay Slot.
pt_br: Adicionar um pequeno entalhe visível pra indicar instruções que estão no slot de atraso de um branch.
uk: Додай невелику видиму позначку для вказівок у слоті затримки гілки.

source: Draw arrows for jumps
es_es: Mostrar flechas para los saltos
pt_br: Desenhar setas pros saltos
uk: Показувати стрілки переходів

source: Display arrows for jumps. This might crowd the display a bit too much.
es_es: Muestra flechas en los saltos. Podría saturar demasiado la cantidad de información mostrada.
pt_br: Exibir setas pros saltos. Isto poderia lotar a tela um pouco demais.
uk: Відображення стрілок переходів. Може перевантажити дисплей.

source: Columns
es_es: Columnas
fr: Colonnes
pt_br: Colunas
uk: Стовпці

source: CPU trace
es_es: Seguimiento de CPU
pt_br: Rastro da CPU
uk: Відстеження ЦП

source: Skip ISR
es_es: Omitir ISR
pt_br: Ignorar ISR
uk: Пропустити ISR

source: Follow PC
es_es: Seguir PC
fr: Suivre PC
pt_br: Seguir o PC
uk: Відстежити PC

source: Jump to PC
es_es: Saltar a PC
pt_br: Saltar pro PC
uk: Перейти до PC

source: In ISR: %s
es_es: En ISR: %s
pt_br: Em ISR: %s
uk: В ISR: %s.

source: Remove symbol
es_es: Quitar símbolo
uk: Вилучити символ

source: Create symbol here
es_es: Crear símbolo aquí
uk: Створити символ

source: Copy Address
es_es: Copiar dirección
pt_br: Copiar Endereço
uk: Копіювати адресу

source: Run to Cursor
es_es: Ejecutar hasta el cursor
pt_br: Executar no Cursor
uk: Запустити до курсора

source: Toggle Breakpoint
es_es: Alternar punto de interrupción
pt_br: Alternar Pontos de Interrupção
uk: Перемкнути точку зупинки

source: Remove Breakpoint
es_es: Quitar punto de interrupción
uk: Вилучити точку зупинки

source: Patch in Return
es_es: Parchear en punto de retorno
uk: Виправити в Return

source: Patch in NOP
es_es: Parchear en NOP
uk: Виправити в NOP

source: Delete Return Patch
es_es: Eliminar parche en retorno
uk: Видалити Return-виправлення

source: Delete NOP Patch
es_es: Eliminar parche en NOP
uk: Видалити NOP-виправлення

source: Assemble
es_es: Ensamblar
uk: Зібрати

source: Address
es_es: Dirección
fr: Adresse
pt_br: Endereço
uk: Адреса

source: RAM base
es_es: Base de RAM
fr: Base de la RAM
pt_br: Base da RAM
uk: RAM-основа

source: Symbols
es_es: Símbolos
pt_br: Símbolos
uk: Символи

source: Add symbol
es_es: Añadir símbolo
uk: Додати символ

source: Add symbol for address 0x%08x:
es_es: Añadir símbolo para la dirección 0x%08x:
uk: Додати символ для адреси 0x%08x:

source: Add
es_es: Añadir
uk: Додати

source: Assemble code for address 0x%08x:
es_es: Ensamblar código para la dirección 0x%08x:
uk: Зібрати код для адреси 0x%08x:

source: Clear
es_es: Borrar
fr: Effacer
pt_br: Limpar
uk: Очистити

source: Close
es_es: Cerrar
pt_br: Fechar
uk: Закрити

source: Refresh
es_es: Actualizar
pt_br: Atualizar
uk: Оновити

source: Filter
es_es: Filtro
fr: Filtre
pt_br: Filtro
uk: Фільтр

source: Code##{}{:08x}
es_es: Código##{}{:08x}
pt_br: Código##{}{:08x}
uk: Код##{}{:08x}

source: Data##{}{:08x}
es_es: Datos##{}{:08x}
pt_br: Dados##{}{:08x}
uk: Дані##{}{:08x}

source: Load Symbols
es_es: Cargar símbolos
fr: Charger les Symboles
pt_br: Carregar Símbolos
uk: Завантаження символів

source: Always
es_es: Siempre
uk: Завжди

source: Greater
es_es: Mayor que
uk: Більше

source: Less
es_es: Menor que
uk: Менше

source: Change
es_es: Cambio
uk: Змінити

source: Equal
es_es: Igual a
uk: Рівно

source: Delete Breakpoint?
es_es: ¿Eliminar el punto de interrupción?
uk: Видалити точку зупинки?

source: Delete
es_es: Eliminar
uk: Видалити

source: Add Breakpoint...
es_es: Añadir punto de interrupción...
uk: Додати точку зупинки...

source: Type
es_es: Tipo
pt_br: Tipo
uk: Тип

source: Byte
uk: Байт

source: Half
uk: Половина

source: Word
uk: Слово

source: Range
es_es: Rango
uk: Діапазон

source: Byte Width
es_es: Longitud de byte
uk: Ширина байту

source: Break Condition
es_es: Condición de interrupción
uk: Умова зупинки

source: Value
es_es: Valor
pt_br: Valor
uk: Значення

source: Current Value
es_es: Valor actual
uk: Поточне значення

source: Label
es_es: Etiqueta
uk: Позначка

source: Breakpoint condition met! Type:%s writing:%d condVal:%d
es_es: ¡Condición de interrupción alcanzada! Tipo: %s Escritura: %d condVal: %d
uk: Умову точки зупинки виконано! Тип: %s запис: %d condVal: %d.

source: Breakpoint condition met! Type:%s reading:%d condVal:%d
es_es: ¡Condición de interrupción alcanzada! Tipo: %s Lectura: %d condVal: %d
uk: Умову точки зупинки виконано! Тип: %s читання: %d condVal: %d.

source: Activate All
es_es: Activar todo
uk: Активувати всі

source: Deactivate All
es_es: Desactivar todo
uk: Деактивувати всі

source: Delete All
es_es: Eliminar todo
uk: Видалити всі

source: Delete all Breakpoints?
es_es: ¿Eliminar todos los puntos de interrupción?
uk: Видалити всі точки зупинки?

source: Execution Map
es_es: Mapa de ejecuciones
uk: Мапа виконання

source: Clear maps
es_es: Borrar mapas
uk: Очистити мапи

source: The mapping feature is a simple concept, but requires some amount of explanation. See the documentation website for more details, in the Misc Features subsection of the Debugging section.
es_es: La característica de los mapas es un concepto simple, pero que necesita su explicación. Para más información (en inglés), visita la web de documentación y busca en «Debugging» la subsección «Misc Features».
uk: Функція призначення - просте поняття, але вимагає певного пояснення. Докладно на веб-сайті документації в підрозділі "Інші функції" розділу "Налагодження".

source: Map execution
es_es: Registrar ejecuciones
pt_br: Mapear execução
uk: Виконання мапи

source: Map byte reads
es_es: Registrar lecturas de bytes
pt_br: Mapear leitura dos bytes
uk: Читання мапи байтами

source: Map half reads
es_es: Registrar lecturas de HWORDs
pt_br: Mapear leituras da metade
uk: Читання мапи половинами

source: Map word reads
es_es: Registrar lecturas de WORDs
pt_br: Mapear leituras das palavras
uk: Читання мапи словами

source: Map byte writes
es_es: Registrar escrituras de bytes
pt_br: Mapear gravações dos bytes
uk: Запис мапи байтами

source: Map half writes
es_es: Registrar escrituras de HWORDs
pt_br: Mapear gravações da metade
uk: Запис мапи половинами

source: Map word writes
es_es: Registrar escrituras de WORDs
pt_br: Mapear gravações das palavras
uk: Запис мапи словами

source: Break on execution map
es_es: Interrumpir en ejecuciones del mapa
pt_br: Ponto de Interrupção no mapa de execução
uk: Зупинка виконання мапи

source: Break on byte read map
es_es: Interrumpir al leer bytes del mapa
pt_br: Ponto de Interrupção no mapa de leitura de bytes
uk: Зупинка читання мапи байтами

source: Break on half read map
es_es: Interrumpir al leer HWORDs del mapa
pt_br: Ponto de Interrupção na metade do mapa lido
uk: Зупинка читання мапи половинами

source: Break on word read map
es_es: Interrumpir al leer WORDs del mapa
pt_br: Ponto de Interrupção no mapa de leitura das palavras
uk: Зупинка читання мапи словами

source: Break on byte write map
es_es: Interrumpir al escribir bytes del mapa
pt_br: Ponto de Interrupção no mapa de gravação dos bytes
uk: Зупинка запису мапи байтами

source: Break on half write map
es_es: Interrumpir al escribir HWORDs del mapa
pt_br: Ponto de Interrupção na metade do mapa gravado
uk: Зупинка запису мапи половинами

source: Break on word write map
es_es: Interrumpir al escribir WORDs del mapa
pt_br: Ponto de Interrupção no mapa de gravação das palavras
uk: Зупинка запису мапи словами

source: Close Console
es_es: Cerrar consola
pt_br: Fechar Console
uk: Закрити консоль

source: Copy
es_es: Copiar
fr: Copier
pt_br: Copiar
uk: Копіювати

source: Auto-scroll
es_es: Desplazamiento automático
pt_br: Auto-rolar
uk: Автогортання

source: Monospace
es_es: Fuente monoespaciada
pt_br: Mono-espaço
uk: Моноширина

source: Input
es_es: Entrada
pt_br: Entrada
uk: Указати

source: Disassemble Buffer
es_es: Desensamblar búfer
pt_br: Fazer Disassembler do Buffer
uk: Буфер розбору

source: Save to File
es_es: Guardar en archivo
pt_br: Salvar no Arquivo
uk: Зберегти до файлу

source: Disassembler Error
es_es: Error del desensamblador
pt_br: Erro do Disassembler
uk: Помилка розбірника.

source: Disassembly Failed. Check Logs
es_es: Error en el desensamblador. Comprueba los registros.
pt_br: O Disassembly Falhou. Verificar os Registros
uk: Не вдалося розібрати. Перевір журнали.

source: Close Disassembler
es_es: Cerrar desensamblador
pt_br: Fechar Disassembler
uk: Закрити розбірник

source: Code size: %.2fMB
es_es: Tamaño del código: %.2f MB
pt_br: Tamanho do Código: %.2fMBs
uk: Розмір коду: %.3f Мбайт.

source: Core
es_es: Núcleo
pt_br: Núcleo
uk: Ядро

source: Spec
pt_br: Especificação
uk: Специфікація

source: Mode
es_es: Modo
pt_br: Modo
uk: Режим

source: Flag
es_es: Indicador
pt_br: Bandeira
uk: Позначка

source: Settings
es_es: Configuración
uk: Налаштування

source: Color Format
es_es: Formato de color
uk: Формат кольору

source: None
es_es: Ninguno
uk: Не вказано

source: Expanded
es_es: Expandido
uk: Розгорнуто

source: GPU logging
es_es: Registro de GPU
uk: ГП-реєстрація

source: Logs each frame's draw calls. When enabled, all the commands sent to the GPU will be logged and displayed here. This will contain only a single frame worth of commands. The feature can be pretty demanding in CPU and memory.
es_es: Registra las llamadas de dibujo de cada fotograma. Al activar esta opción, se registrarán y mostrarán aquí todos los comandos enviados a la GPU. Esta ventana solo mostrará los comandos de un fotograma. Esta opción puede necesitar de muchos recursos de CPU y memoria.
uk: Реєстрація кожного виклику показу кадру. Усі надіслані до ГП команди буде зареєстровано та відображено. Міститиметься лише один кадр зі значеннями команд. Функція може бути досить вимогливою до ЦП та пам'яті.

source: Breakpoint on vsync
es_es: Interrumpir durante V-Sync
pt_br: Ponto de Interrupção no Vsync
uk: Точка зупинки при вертикальній синхронізації

source: Replay frame
es_es: Repetir fotograma
uk: Повторити кадр

source: When enabled, the framebuffer will be constantly redrawned using the selected commands, allowing to see the resulting output immediately. This doesn't make sense to have this enabled when: (1) the CPU is running and (2) the GPU logging isn't enabled. Selection of which commands to replay is done using the first checkbox in the logger display below. The [T] button will select all commands for replay from the top and until this command.
es_es: Al activar esta opción, el búfer de fotogramas será reescrito constantemente con los comandos seleccionados, lo que permitirá mostrar la salida resultante de forma inmediata. No tiene sentido activar esta opción en los siguientes casos: (1) si la CPU está funcionando y (2) si el registro de la GPU no está activado. Puedes seleccionar qué comandos repetir con la primera casilla de la ventana de registro que hay debajo. El botón [T] seleccionará todos los comandos desde el primero hasta el que se muestre para repetirlos.
uk: Буфер кадрів буде постійно перепоказано вибраними командами для дозволу негайного показу результату. Безсенсово вмикати функцію при роботі ЦП та вимкненому журналі ГП. Команди для повтору буде вибрано першою позначкою наведеного дисплея реєстратора. Кнопка [T] - вибір усіх команд для повтору від початку до команди.

source: Show origins
es_es: Mostrar orígenes
uk: Показати джерела

source: When enabled, the logger display will also show where did the command come from, which can be useful to debug or reverse engineer, but will also clutter the logger view.
es_es: Al activar esta opción, la ventana de registro también mostrará de dónde proviene el comando, lo que puede ser útil para tareas de depuración o de ingeniería inversa, pero también saturará la ventana de registro.
uk: У дисплеї реєстратора також буде показано, звідки надіслано команду, що може бути корисно для налагодження чи зворотного проектування, але також буде заважати перегляду реєстратора.

source: Collapse all nodes
es_es: Contraer todos los nodos
uk: Згорнути всі вузли

source: Keep collapsed
es_es: Mantener contraídos
uk: Залишити згорнутим

source: Expand all nodes
es_es: Expandir todos los nodos
uk: Розгорнути всі вузли

source: Keep expanded
es_es: Mantener expandidos
uk: Розгорнути всі вузли

source: Remove all highlight selections
es_es: Quitar todas las selecciones resaltadas
uk: Вилучити всі виділені вибори

source: Highlight on hover
es_es: Resaltar al pasar el cursor por encima
uk: Виділити при наведенні

source: When enabled, hovering a command in the logger view will highlight it in the vram display. Individual commands can be selected for highlight by using the second checkbox in the logger view. The [B] and [E] buttons can be used to specify the beginning and the end of a span of commands to highlight.
es_es: Al activar esta opción, cuando pases el cursor del ratón sobre un comando en la ventana de registro, este se resaltará en el visualizador de VRAM. Se pueden seleccionar comandos individuales para resaltarlos con la segunda casilla de la ventana de registro. Los botones [B] y [E] pueden utilizarse para especificar el inicio y el final de un rango de comandos a resaltar.
uk: Наведення на команду в режимі реєстратора для виділення її на vram-дисплеї. Можливий вибір окремих команд для виділення другою позначкою у вікні реєстратора. Кнопки [B] і [E] вказують початок і кінець діапазону команд для виділення.

source: Filter by pixel
es_es: Filtrar por píxeles
uk: Фільтрувати за пікселем

source: When enabled, only the commands that are related to the specified pixel will be shown. The pixel location is specified in the next input fields. The [Probe VRAM] button can be used to set the pixel location by hovering and clicking inside the VRAM viewer.
es_es: Al activar esta opción, se mostrarán únicamente los comandos relacionados con el píxel especificado. La ubicación del mismo puede especificarse en los campos de entrada de más abajo. Puedes utilizar el botón [Sondear VRAM] para establecer la ubicación del píxel si haces clic con el ratón dentro del visualizador de VRAM.
uk: При увімкненні буде показано лише команди, пов'язані з указаним пікселем. Розташування пікселя вказується в наступних полях. Кнопку [Probe VRAM] можна використовувати для встановлення розташування пікселя наведенням курсора та натсиканнням усередині VRAM-переглядача.

source: Pixel location
es_es: Ubicación del píxel
uk: Положення пікселя

source: Probe VRAM
es_es: Sondear VRAM
uk: Дослідити VRAM

source: When enabled, hovering then clicking inside the VRAM viewer will set the pixel location for the filtering.
es_es: Al activar esta opción, se podrá establecer la ubicación del píxel a filtrar haciendo clic dentro del visualizador de VRAM.
uk: При увімкненні буде встановлено розташування пікселя для фільтрації наведенням курсора та натисканням усередині VRAM-переглядача.

source: Frame {}###FrameCounterNode
es_es: Fotograma {}###FrameCounterNode
uk: Кадр {}###Вузол лічильника кадрів

source: Reset frame counter
es_es: Reiniciar contador de fotogramas
uk: Очистити лічильник кадрів

source: %i primitives
es_es: %i primitivos
uk: %i первісних

source: %i triangles
es_es: %i triángulos
uk: %i 3-кутників

source: %i textured triangles
es_es: %i triángulos texturizados
uk: %i текстурних 3-кутників

source: %i rectangles
es_es: %i rectángulos
uk: %i прямокутників

source: %i sprites
uk: %i спрайтів

source: %i pixel writes
es_es: %i escrituras a píxeles
uk: %i пікселів записано

source: %i pixel reads
es_es: %i lecturas a píxeles
uk: %i пікселів прочитано

source: %i texel reads
es_es: %i lecturas a texels
uk: %i текселів прочитано

source: Data port write: %08x
es_es: Escritura a puerto de datos: %08x
uk: Запис порту даних: %08x.

source: Control port write: %08x
es_es: Escritura a puerto de control: %08x
uk: Запис порту керування: %08x.

source: Direct DMA from
es_es: Dirigir DMA desde
uk: Безпосередній DMA з

source: Chain DMA from
es_es: Encadenar DMA desde
uk: Ланцюговий DMA з

source: at PC =
es_es: en PC =
uk: на комп'ютері =

source: Invalid data at 0x100
es_es: Datos no válidos en 0x100
pt_br: Dados inválidos no 0x100
uk: Недійсні дані в 0x100.

source: Handlers info at %08x
es_es: Información de controladores en %08x
uk: Дані опрацьовувача в %08x

source: Priority {}
es_es: Prioridad {}
uk: Пріоритет {}

source: No handlers
es_es: No hay controladores
uk: Без опрацьовувачів

source: Handler data at
es_es: Datos de controlador en
uk: Дані опрацьовувача в

source: verifier:
es_es: comprobador:
pt_br: Verificador:
uk: верифікатор:

source: handler:
es_es: controlador:
pt_br: Manipulador:
uk: опрацьовувач:

source: No iso or invalid iso loaded.
es_es: No hay una ISO o se ha cargado una ISO no válida.
uk: Відсутній або недійсний ISO-образ.

source: GAME Label: %s
es_es: Etiqueta de juego: %s
uk: Позначка гри: %s

source: Cache files
es_es: Almacenar archivos en caché
uk: Файли кешу

source: Compute CRCs
es_es: Calcular CRC
uk: Визначити контрольні суми

source: Computes the CRC32 of each track, and of the whole disk. The CRC32 is computed on the raw data, after decompression of the tracks. This is useful to check the disk image against redump's information. The computation can be slow, and can be sped up significantly by caching the files beforehand.
es_es: Calcula la suma de comprobación CRC32 tanto del disco entero como por pistas. La suma CRC32 se calculará a partir de los datos en bruto de las pistas una vez descomprimidas. Es útil para comprobar una imagen de disco con la información de Redump. El cálculo puede ser lento, así que puede acelerarse en gran medida guardando los archivos en caché antes de nada.
uk: Визначення CRC32 кожної доріжки й усього диска. CRC32 буде визначено за початковими даними після видобування доріжок. Корисно для перевірки образу диска на зменшення відомостей. Визначення може бути повільним, можливе значне прискорення попереднім кешуванням файлів.

source: Disc size: {} ({}) - CRC32: {:08x}
es_es: Tamaño del disco: {} ({}) - CRC32: {:08x}
uk: Розмір диска: {} ({}) - CRC32: {:08x}.

source: Track
es_es: Pista
uk: Доріжка

source: Length
es_es: Longitud
uk: Тривалість

source: Pregap
uk: Попередній розрив

source: Enabled
es_es: Activados
pt_br: Ativado
uk: Увімкнено.

source: Enable all
es_es: Activar todo
pt_br: Ativar tudo
uk: Увімкнути все

source: Disable all
es_es: Desactivar todo
pt_br: Desativar Tudo
uk: Вимкнути все

source: Displayed
es_es: Mostrados
pt_br: Exibido
uk: Відображено.

source: Display all
es_es: Mostrar todo
pt_br: Exibir tudo
uk: Відобразити все

source: Hide all
es_es: Ocultar todo
pt_br: Esconder tudo
uk: Приховати все

source: Special
es_es: Especial
pt_br: Especial
uk: Особливі

source: Log CD-ROM commands
es_es: Registrar comandos del CD-ROM
pt_br: Registrar comandos do CD-ROM
uk: Журнал CD-ROM-команд

source: Skip ISR during CPU traces
es_es: Omitir ISR en los seguimientos de la CPU
pt_br: Ignorar ISR durante os rastreamentos da CPU
uk: Пропустити ISR упродовж відстежень ЦП

source: Log kernel calls
es_es: Registrar llamadas al kernel
pt_br: Registrar chamadas do Kernel
uk: Журнал викликів ядра

source: Follow
es_es: Seguir
fr: Suivre
pt_br: Seguir
uk: Відстежити

source: Auto run
es_es: Ejecutar automáticamente
pt_br: Auto-executar
uk: Автозапуск

source: Auto save
es_es: Autoguardado
pt_br: Auto-salvar
uk: Автозбереження

source: > Run
es_es: > Ejecutar
pt_br: > Executar
uk: > Запустити

source: Display
es_es: Mostrar
pt_br: Exibição
uk: Відобразити

source: Raw
es_es: Sin procesar
pt_br: Bruto
uk: Основа

source: Import file into memory card 1
es_es: Importar archivo en Memory Card 1
uk: Імпортувати файл карти пам'яті 1

source: Import file into memory card 2
es_es: Importar archivo en Memory Card 2
uk: Імпортувати файл карти пам'яті 2

source: Export memory card 1 to file
es_es: Exportar Memory Card 1 a archivo
uk: Експортувати карту пам'яті 1 до файлу

source: Export memory card 2 to file
es_es: Exportar Memory Card 2 a archivo
uk: Експортувати карту пам'яті 2 до файлу

source: Undo
es_es: Deshacer
pt_br: Desfazer
uk: Скасувати

source: Undo version:
es_es: Versión de acción deshecha:
pt_br: Desfazer versão:
uk: Версія скасування:

source: Latest
es_es: Última
pt_br: Mais recentes
uk: Остання

source: Clear Undo buffer
es_es: Borrar búfer de acciones deshechas
pt_br: Limpar o buffer do desfazer
uk: Очистити буфер скасувань

source: Memory Card 1 inserted
es_es: Tarjeta de memoria 1 introducida
pt_br: Memory Card 1 inserido
uk: Карту пам'яті 1 вставлено.

source: Memory Card 2 inserted
es_es: Tarjeta de memoria 2 introducida
pt_br: Memory Card 2 inserido
uk: Карту пам'яті 2 вставлено.

source: Card 1 Pocketstation
es_es: Tarjeta 1 PocketStation
pt_br: Cartão 1 do Pocketstation
uk: Pocketstation-карта 1

source: Experimental. Emulator will attempt to send artificial responses to Pocketstation commands, possibly allowing apps to be saved/exported.
es_es: Experimental. El emulador intentará enviar respuestas artificiales a los comandos de PocketStation, lo que tal vez permita el guardado o exportado de aplicaciones.
pt_br: Experimental. O emulador tentará enviar respostas artificiais aos comandos do Pocketstation possivelmente permitindo que os aplicativos sejam salvos/exportados.
uk: Експериментально. Емулятор буде намагатися надіслати штучні відповіді на команди Pocketstation, можливо, дозволяючи зберігати / експортувати додатки.

source: Card 2 Pocketstation
es_es: Tarjeta 2 PocketStation
pt_br: Cartão 2 do Pocketstation
uk: Pocketstation-карта 2

source: Icon size
es_es: Tamaño de icono
pt_br: Tamanho do ícone
uk: Розмір піктограми

source: Draw Pocketstation icons
es_es: Mostrar iconos de PocketStation
pt_br: Desenhar ícones do Pocketstation
uk: Показувати піктограми Pocketstation

source: Block number
es_es: N.º de bloque
pt_br: Número do bloco
uk: Номер блоку

source: Icon
es_es: Icono
pt_br: Ícone
uk: Піктограма

source: Title
es_es: Título
pt_br: Título
uk: Назва

source: Action
es_es: Acción
pt_br: Ação
uk: Дія

source: Chained block
es_es: Bloque adjunto
pt_br: Bloco acorrentado
uk: Ланцюговий блок

source: Free block
es_es: Bloque vacío
pt_br: Bloco livre
uk: Вільний блок

source: %s (%dKB)
pt_br: %s (%dKBs)
uk: %s (%d Кбайт)

source: Erase##{}
es_es: Borrar##{}
pt_br: Apagar##{}
uk: Стерти##{}

source: Erased file {}({}) off card {}
es_es: Se ha borrado el archivo {}({}) de la tarjeta {}
pt_br: Arquivo apagado {}({}) fora do cartão {}
uk: Стерто файл {}({}) із карти {}.

source: Copy##{}
es_es: Copiar##{}
pt_br: Copiar##{}
uk: Копіювати##{}

source: Copied file {}({}) from card {} to card {}
es_es: Se ha copiado el archivo {}({}) de la tarjeta {} a la tarjeta {}
pt_br: Copiou o arquivo({}({}) do cartão {} pro cartão {}
uk: Копійовано файл {}({}) із карти {} до карти {}.

source: Move##{}
es_es: Mover##{}
pt_br: Mover##{}
uk: Перемістити##{}
