Repository: grumpycoders/pcsx-redux
Catalog: i18n/*.po
Languages: es_es, fr, pt_br, uk

source: Could not find audio stream in the input, aborting
fr: Impossible de trouver le flux audio dans la source. Abandon.

source: Could not find stream information
fr: Impossible de trouver les détails du flux

source: Could not load cheats from: %s
fr: Impossible de charger les cheats à partir de : %s

source: Could not open BIOS:"%s". Enabling HLE Bios!
fr: Impossible d'ouvrir le BIOS : "%s". Utilisation du Bios HLE !

source: Could not open resample context
fr: Could not allocate resample context

source: Could not open source file %s
fr: Impossible d'ouvrir le fichier source %s

source: Debug kernel
fr: Débug du kernel

source: Decoded buffers IRQ
fr: IRQ quand tampons décodés

source: Decoding audio tr#%u (%s)...
fr: Décodage de l'audio tr#%u (%s)...

source: Directories
fr: Répertoires

source: Disabled
fr: Désactivé

source: Enable counters
fr: Activer les compteurs

source: Error decoding audio frame
fr: Erreur lors du décodage de la trame audio

source: Error initializing GPU plugin: %d
fr: Erreur lors de l’initialisation du plugin GPU : %d

source: Error initializing NetPlay plugin: %d
fr: Erreur lors de l'initialisation du plugin NetPlay : %d

source: Error initializing SIO1 plugin: %d
fr: Erreur lors de l'initialisation du plugin SIO1 : %d

source: Error initializing SPU plugin: %d
fr: Erreur lors de l'initialisation du plugin SPU : %d

source: Error loading %s: %s
fr: Erreur lors du chargement de %s : %s

source: Error opening file: %s.
fr: Erreur lors de l'ouverture du fichier : %s.

source: Failed to find %s codec
fr: Impossible de trouver le codec %s

source: Failed to open %s codec
fr: Impossible d'ouvrir le codec %s

source: Files
fr: Fichiers

source: Fullscreen render
fr: Afficher en plein-écran

source: Generates IRQs when buffers are decoded.
fr: Génère des IRQ lorsque les tampons sont décodés.

source: Home
fr: Origine

source: Invalid PPF patch: %s.
fr: Patch PPF invalide :%s.

source: Loaded PPF %d.0 patch: %s.
fr: Patch PPF %d.0 chargé : %s.

source: Log events
fr: Journal des événements

source: Log new syscalls
fr: Journal des nouveaux syscalls

source: Memorize
fr: Mémoriser

source: No memory card value was specified - card %i is not plugged.
fr: Aucune valeur de carte mémoire n'a été spécifiée - la carte %i n'est pas présente.

source: Open ISO
fr: Ouvrir un ISO

source: Open Image
fr: Ouvrir un fichier image

source: Plugins loaded.
fr: Plugins chargés.

source: Pseudo-instrucitons filling
fr: Remplacement des pseudo-instructions

source: Remove breakpoint from here
fr: Retirer les Breakpoints à partir d'ici

source: Remove##
fr: Enlever##

source: Roots
fr: Racines

source: Run to cursor
fr: Exécuter jusqu'au curseur

source: Set Breakpoint here
fr: Placer un Breakpoint ici

source: Show BIOS counters
fr: Afficher les compteurs du BIOS

source: Show all breakpoints
fr: Afficher tous les breakpoints

source: Show no breakpoints
fr: Ne pas afficher de Breakpoints

source: Skip unknowns
fr: Ignorer les inconnus

source: Start
fr: Démarrer

source: This file does not appear to be a valid PSX file.
fr: Ce fichier ne semble pas être un fichier PSX valide.

source: Unknown CPE opcode %02x at position %08x.
fr: Opcode CPE inconnu %02x à la position %08x.

source: Unsupported PPF version (%d).
fr: Version du PPF non-supportée (%d).

source: ^ Date & Time
fr: ^ Date & Heure

source: ^ File
fr: ^ Fichier

source: ^ Size
fr: ^ Taille

source: renderer
fr: carte graphique

source: shading language version
fr: version GLSL

source: v Date & Time
fr: v Date & Heure

source: v File
fr: v Fichier

source: v Size
fr: v Taille

source: vendor
fr: fabriquant

source: version
fr: version OpenGL
