Repository: grumpycoders/pcsx-redux
Catalog: i18n/*.po
Languages: es_es, fr, pt_br, uk

source: Detected ECM file with proper header and filename suffix.
es_es: Detectado un archivo ECM con la cabecera y el sufijo en su nombre de archivo correctos.
fr: Fichier ECM détecté avec l'en-tête et le suffixe du nom de fichier appropriés.
pt_br: Arquivo ECM detectado com o sufixo de cabeçalho e nome de arquivo apropriado.
uk: Виявлено ECM з правильним заголовком і суфіксом імені файлу.

source: Loaded SBI file: %s.
es_es: Se ha cargado el archivo SBI: %s.
fr: Fichier SBI chargé : %s.
pt_br: Arquivo SBI carregado: %s.
uk: Завантажено SBI: %s.

source: Track %.2d (%s) - Start %.2d:%.2d:%.2d, Length %.2d:%.2d:%.2d
es_es: Pista %.2d (%s) - Inicio %.2d:%.2d:%.2d, longitud %.2d:%.2d:%.2d
fr: Piste %.2d (%s) - Commence à %.2d:%.2d:%.2d, Durée %.2d:%.2d:%.2d
pt_br: Faixa %.2d (%s) - Início %.2d:%.2d:%.2d, Duração %.2d:%.2d:%.2d
uk: Трек %.2d (%s) - початок: %.2d:%.2d:%.2d, тривалість: %.2d:%.2d:%.2d.

source: Loaded CD Image: %s
es_es: Se ha cargado la imagen de CD: %s
fr: Image CD chargée : %s
pt_br: Imagem do CD Carregada: %s
uk: Завантажено CD-образ: %s.

source: OpenGL GPU configuration
es_es: Configuración de GPU por OpenGL
pt_br: Configuração da GPU do OpenGL
uk: Конфігурація ГП Open GL

source: Fill polygons
es_es: Llenar polígonos
uk: Заповнені полігони

source: Wireframe
es_es: Malla
uk: Каркас

source: Vertices only
es_es: Solo vértices
uk: Лише вершини

source: Polygon rendering mode
es_es: Modo de renderizado de polígonos
pt_br: Modo de renderização dos polígonos
uk: Режим опрацювання полігонів

source: No MSAA
es_es: Desactivar MSAA
pt_br: Sem MSAA
uk: Без MSAA

source: Use linear filtering
es_es: Usar filtrado lineal
pt_br: Usar filtragem linear
uk: Використовувати лінійну фільтрацію

source: Edit OpenGL GPU shaders
es_es: Editar shaders de GPU para OpenGL
uk: Редагувати ГП-шейдери Open GL

source: OpenGL GPU Debugger
es_es: Depurador de GPU por OpenGL
pt_br: Debugger da GPU do OpenGL
uk: ГП-налагоджувач Open GL

source: Display horizontal range: %d-%d
es_es: Mostrar rango horizontal: %d-%d
pt_br: Exibir alcance horizontal: %d-%d
uk: Горизонтальний діапазон дисплея: %d-%d

source: Display vertical range: %d-%d
es_es: Mostrar rango vertical: %d-%d
pt_br: Exibir alcance vertical: %d-%d
uk: Вертикальний діапазон дисплея: %d-%d

source: Drawing area offset: (%d, %d)
es_es: Desplazamiento del área de dibujo: (%d, %d)
pt_br: Deslocamento da área de desenho: (%d, %d)
uk: Зміщення області показу: (%d, %d)

source: Resolution: %dx%d
es_es: Resolución: %d×%d
pt_br: Resolução: %dx%d
uk: Розмір: %d * %d

source: Clear colour
es_es: Eliminar color
pt_br: Limpar a cor
uk: Очистити колір

source: Clear VRAM
es_es: Borrar VRAM
pt_br: Limpar VRAM
uk: Очистити VRAM

source: CD-ROM Label: %.32s
es_es: Etiqueta de CD-ROM: %.32s
fr: Titre du CD-ROM : %.32s
pt_br: Rótulo do CD-ROM: %.32s
uk: Позначка CD-ROM: %.32s

source: CD-ROM EXE Name: %.255s
es_es: Nombre de ejecutable del CD-ROM: %.255s
fr: Nom de l'EXE du CD-ROM : %.255s
pt_br: Nome do EXE do CD-ROM: %.255s
uk: Ім'я CD-ROM EXE: %.255s

source: Execution map
es_es: Mapa de ejecuciones
pt_br: Mapa de execução
uk: Мапа виконання

source: Kernel checker: Jump from 0x%08x to 0x%08x
es_es: Comprobación del kernel: salto de 0x%08x a 0x%08x
uk: Перевірка ядра: перехід від 0x%08x до 0x%08x.

source: Read 8 map
es_es: Leer mapa de 8 bits
pt_br: Ler o mapa 8
uk: Читати мапу 8

source: Read 16 map
es_es: Leer mapa de 16 bits
pt_br: Ler o mapa 16
uk: Читати мапу 16

source: Read 32 map
es_es: Leer mapa de 32 bits
pt_br: Ler o mapa 32
uk: Читати мапу 32

source: Write 8 map
es_es: Escribir mapa de 8 bits
pt_br: Gravar mapa 8
uk: Записати мапу 8

source: Write 16 map
es_es: Escribir mapa de 16 bits
pt_br: Gravar mapa 16
uk: Записати мапу 16

source: Write 32 map
es_es: Escribir mapa de 32 bits
pt_br: Gravar mapa 32
uk: Записати мапу 32

source: Kernel checker: Reading %08x from %08x
es_es: Comprobación del kernel: leyendo %08x desde %08x
uk: Перевірка ядра: читання %08x із %08x.

source: Kernel checker: Writing to %08x from %08x
es_es: Comprobación del kernel: escribiendo a %08x desde %08x
uk: Перевірка ядра: запис до %08x із %08x.

source: Step in
es_es: Avanzar una
pt_br: Intervir
uk: Увійти

source: Step Over
es_es: Salir de
pt_br: Passar por Cima
uk: Пропустити

source: Step over
es_es: Salir de
pt_br: Passo sobre
uk: Пропустити

source: Step out (no callstack)
es_es: Saltar una (sin pila de llamadas)
pt_br: Sair (sem pilha de chamadas)
uk: Вийти (без стека викликів)

source: Breakpoint triggered: PC=0x%08x - Cause: %s %s
es_es: Interrupción activada: PC=0x%08x - Motivo: %s %s
pt_br: Ponto de Interrupção engatilhado: PC=0x%08x - Causa: %s %s
uk: Викликано точку зупинки: PC = 0x%08x - Причина: %s %s.

source: Step Out
es_es: Saltar una
pt_br: Sair
uk: Вийти

source: Exec
uk: Виконання

source: Read
es_es: Lectura
pt_br: Leitura
uk: Читання

source: Write
es_es: Escritura
pt_br: Gravação
uk: Запис

source: GDB client
es_es: Cliente GDB
pt_br: Cliente GDB
uk: GDB-клієнт

source: GPU DMA went into usable but uninitialized msan memory: %8.8lx
es_es: Un DMA de la GPU ha ido a memoria de msan utilizable, pero sin inicializar: %8.8lx
uk: DMA ГП перейшов до придатної невизначеної MSAN-пам'яті: %8.8lx.

source: GPU DMA went into unusable msan memory: %8.8lx
es_es: Un DMA de la GPU ha ido a memoria de msan no utilizable: %8.8lx
uk: DMA ГП перейшов до непридатної MSAN-пам'яті: %8.8lx.

source: Shading: Flat
es_es: Sombreado: plano
uk: Затемнення: плоске

source: Shading: Gouraud
es_es: Sombreado: Gouraud
uk: Затемнення: Гуро

source: Textured
es_es: Texturización
uk: Текстурний

source: Semi-transparency blending
es_es: Mezcla de semitransparencias
uk: Напівпрозоре накладання

source: Vertex %i
es_es: Vértice %i
uk: Вершинний %i

source: Go to primitive##{}
es_es: Ir a primitivo##{}
uk: Перейти до первісного##{}

source: Go to texture##{}
es_es: Ir a textura##{}
uk: Перейти до текстури##{}

source: Go to CLUT##{}
es_es: Ir a CLUT##{}
uk: Перейти до таблиці пошуку кольорів (CLUT)##{}

source: Line %i
es_es: Línea %i
uk: Лінія %i

source: Texture Page X: %i, Texture Page Y: %i
es_es: Página X de texturas: %i, página Y de texturas: %i
uk: Сторінка текстури X: %i, Сторінка текстури Y: %i

source: Blending:
es_es: Mezcla:
uk: Накладання:

source: 50% Back + 50% Front
es_es: 50 % de fondo + 50 % de frente
uk: 50 % Назад + 50 % Уперед

source: 100% Back + 100% Front
es_es: 100 % de fondo + 100 % de frente
uk: 100 % Назад + 100 % Уперед

source: 100% Back - 100% Front
es_es: 100 % de fondo - 100 % de frente
uk: 100 % Назад - 100 % Уперед

source: 100% Back + 25% Front
es_es: 100 % de fondo + 25 % de frente
uk: 100 % Назад + 25 % Уперед

source: Texture depth:
es_es: Profundidad de color de textura:
uk: Глибина текстури:

source: 4 bits
uk: 4 біт

source: 8 bits
uk: 8 біт

source: 16 bits
uk: 16 біт

source: Dithering: %s
es_es: Tramado: %s
uk: Згладжування: %s.

source: No
uk: Ні

source: Yes
es_es: Sí
uk: Так

source: Set: %s, Check: %s
es_es: Activo: %s, comprobar: %s
uk: Встановлено: %s, Перевірено: %s.

source: Display Enabled
es_es: Mostrar activados
uk: Увімкнути відображення

source: Display Disabled
es_es: Mostrar desactivados
uk: Вимкнути відображення

source: DMA Off
es_es: DMA desactivado
uk: Вимкнути DMA

source: FIFO Query
es_es: Consulta FIFO
uk: FIFO-запит

source: DMA Read
es_es: Lectura del DMA
uk: DMA-читання

source: DMA Write
es_es: Escritura al DMA
uk: DMA-запис

source: Horizontal resolution:
es_es: Resolución horizontal:
uk: Горизонтальний розмір:

source: Extended width mode: %s
es_es: Modo de ancho extendido: %s
uk: Режим розширеної ширини: %s.

source: Vertical resolution:
es_es: Resolución vertical:
uk: Вертикальний розмір:

source: Output mode: %s
es_es: Modo de salida: %s
uk: Режим показу: %s.

source: 15 bits
uk: 15 біт

source: 24 bits
uk: 24 біт

source: Display depth: %s
es_es: Profundidad de colores de imagen: %s
uk: Глибина відображення: %s.

source: Interlaced: %s
es_es: Entrelazado: %s
uk: Черезрядково розгорнуто: %s.

source: Texture Window
es_es: Ventana de texturas
uk: Текстурне вікно

source: Draw Area Start
es_es: Inicio de área de dibujado
uk: Показати початок області

source: Draw Area End
es_es: Fin de área de dibujado
uk: Показати кінець області

source: Draw Offset
es_es: Desplazamiento de dibujado
uk: Показати зміщення

source: Unknown
es_es: Elemento desconocido
uk: Невідомо

source: Unaligned address 0x%08x in LWC2 from 0x%08x
es_es: Dirección sin alinear 0x%08x en LWC2 de 0x%08x
uk: Нерівна адреса 0x%08x в LWC2 з 0x%08x.

source: Unaligned address 0x%08x in SWC2 from 0x%08x
es_es: Dirección sin alinear 0x%08x en SWC2 de 0x%08x
uk: Нерівна адреса 0x%08x в SWC2 з 0x%08x.

source: The memory card %s doesn't exist - creating it
es_es: La tarjeta de memoria %s no existe, creando una nueva.
fr: La carte mémoire %s n'existe pas - création en cours
pt_br: O memory card %s não existe - criando.
uk: Карта пам'яті %s не існує - створено.

source: Error reading memory card.
es_es: Error al leer la tarjeta de memoria.
pt_br: Erro ao ler o memory card.
uk: Помилка читання карти пам'яті.

source: Memory card %s failed to load!
es_es: ¡La tarjeta de memoria %s ha fallado al cargar!
fr: Impossible de charger la carte mémoire %s !
pt_br: O cartão de memória %s falhou ao carregar!
uk: Не вдалося завантажити карту пам'яті %s!

source: Loading memory card %s
es_es: Cargando tarjeta de memoria %s
fr: Chargement de la carte mémoire %s
pt_br: Carregando o memory card %s
uk: Завантаження карти пам'яті %s.

source: Saving memory card %s
es_es: Guardando tarjeta de memoria %s
fr: Sauvegarde de la carte mémoire %s
pt_br: Salvando o memory card %s
uk: Збереження карти пам'яті %s.

source: Unknown command for pad: %02X
es_es: Comando de mando desconocido: %02X
pt_br: Comando desconhecido pro pad: %02X
uk: Невідома команда джойстика: %02X.

source: Pad configuration
es_es: Configuración de mandos
pt_br: Configuração do pad
uk: Конфігурація джойстика

source: Rescan gamepads and re-read game controllers database
es_es: Volver a buscar mandos y a leer la base de datos de mandos
pt_br: Re-escanear os gamepads e reler o banco de dados dos controles dos jogos
uk: Пересканувати джойстики та перечитати базу даних ігрових контролерів

source: Use raw input for mouse
es_es: Utilizar entrada sin procesar del ratón
pt_br: Usar entrada bruta pro mouse
uk: Використовувати неопрацьоване керування для миші

source: When enabled, the cursor will be hidden and captured when the emulator is running. This is useful for games that require mouse input.
es_es: Al activar esta opción, se ocultará y capturará el ratón mientras el emulador esté en funcionamiento. Ideal para juegos que necesitan ratón.
uk: Курсор буде приховано та захоплено при роботі емулятора. Корисно для ігор із керуванням мишею.

source: Allow mouse capture toggle
es_es: Habilitar alternancia de captura del ratón
uk: Дозволити захоплення миші

source: When enabled, pressing CTRL and ALT will toggle the setting above, raw input
es_es: Al activar esta opción, si pulsas CTRL y ALT podrás alternar la opción anterior con el modo de entrada sin procesar.
uk: Натиснення Control і Alt перемикає налаштування вище, початкові дані.

source: Set defaults
es_es: Valores predeterminados
pt_br: Definir padrões
uk: Встановити типові

source: Keyboard Up
es_es: Teclado - Arriba
pt_br: Teclado Pra Cima
uk: Клавіатура ↑

source: Keyboard Right
es_es: Teclado - Derecha
pt_br: Teclado Direita
uk: Клавіатура →

source: Keyboard Down
es_es: Teclado - Abajo
pt_br: Teclado Pra Baixo
uk: Клавіатура ↓

source: Keyboard Left
es_es: Teclado - Izquierda
pt_br: Teclado Esquerda
uk: Клавіатура ←

source: Keyboard Backspace
es_es: Teclado - Retroceso
pt_br: Backspace do Teclado
uk: Клавіатура Backspace

source: Keyboard Enter
es_es: Teclado - Intro
pt_br: Teclado Enter
uk: Клавіатура Enter

source: Keyboard Space
es_es: Teclado - Espacio
pt_br: Teclado Barra de Espaço
uk: Клавіатура Space

source: Keyboard Escape
es_es: Teclado - Esc
pt_br: Teclado Escape
uk: Клавіатура Escape

source: Unbound
es_es: Sin asignar
pt_br: Sem Limites
uk: Вільно

source: Unknown keyboard key {}
es_es: Tecla de teclado desconocida: {}
pt_br: Tecla do teclado desconhecida {}
uk: Невідома кнопка клавіатури {}

source: Keyboard {}
es_es: Teclado {}
pt_br: Teclado {}
uk: Клавіатура {}

source: Auto
es_es: Elegir automáticamente
uk: Автоматично

source: Controller
es_es: Mando
pt_br: Controle
uk: Контролер

source: Keyboard
es_es: Teclado
pt_br: Teclado
uk: Клавіатура

source: Analog Mode
es_es: Modo analógico
pt_br: Modo Analógico
uk: Аналоговий режим

source: Digital
uk: Цифра

source: Analog
pt_br: Analógico
uk: Аналог

source: Mouse
es_es: Ratón
uk: Миша

source: Negcon (Unimplemented)
es_es: NegCon (sin implementar)
pt_br: Negcon (Não Implementado)
uk: Negcon (Не реалізовано)

source: Gun (Unimplemented)
es_es: Lightgun (sin implementar)
pt_br: Arma (Não Implementada)
uk: Gun (Не реалізовано)

source: Guncon (Unimplemented)
es_es: Guncon (sin implementar)
uk: Guncon (Не реалізовано)

source: Connected
es_es: Conectado
pt_br: Conectado
uk: З'єднано

source: Analog mode
es_es: Modo analógico
pt_br: Modo Analógico
uk: Аналоговий режим

source: Controller Type
es_es: Tipo de mando
pt_br: Tipo de Controle
uk: Тип контролера

source: Device type
es_es: Tipo de dispositivo
pt_br: Tipo de dispositivo
uk: Тип пристрою

source: Mouse sensitivity X
es_es: Sensibilidad X del ratón
pt_br: Sensibilidade do mouse X
uk: Чутливість миші X

source: Mouse sensitivity Y
es_es: Sensibilidad Y del ratón
pt_br: Sensibilidade do mouse Y
uk: Чутливість миші Y

source: Keyboard mapping
es_es: Asignaciones del teclado
pt_br: Mapeamento do teclado
uk: Призначення клавіатури

source: Computer button mapping
es_es: Asignación del equipo
pt_br: Mapeamento do botão do computador
uk: Призначення кнопки комп'ютера

source: Gamepad button
es_es: Botón de mando
pt_br: Botão do Gamepad
uk: Кнопка джойстика

source: No gamepad selected or connected
es_es: No se ha seleccionado o conectado un mando
pt_br: Nenhum gamepad selecionado ou conectado
uk: Джойстик не вибрано та не з'єднано.

source: Gamepad
es_es: Mando
uk: Джойстик

source: Unknown 8-bit read in EXP1/PIO: %8.8lx
es_es: Lectura desconocida de 8 bits en EXP1/PIO: %8.8lx
uk: Невідоме 8-бітне читання в EXP1 / PIO: %8.8lx.

source: Unknown 8-bit write in EXP1/PIO: %8.8lx
es_es: Escritura desconocida de 8 bits en EXP1/PIO: %8.8lx
uk: Невідомий 8-бітний запис у EXP1 / PIO: %8.8lx.

source: Called msanGetChainPtr with invalid header pointer %8.8lx
es_es: Se ha invocado a msanGetChainPtr con el puntero de cabecera no válido %8.8lx
uk: Викликано msanGetChainPtr із недійсним указівником заголовка %8.8lx.

source: Called msanSetChainPtr with invalid header pointer %8.8lx
es_es: Se ha invocado a msanSetChainPtr con el puntero de cabecera no válido %8.8lx
uk: Викликано msanSetChainPtr із недійсним указівником заголовка %8.8lx.

source: Signed overflow in ADDI instruction from 0x%08x!
es_es: ¡Desbordamiento con signo en la instruccion ADDI de 0x%08x!
pt_br: Sobrecarga assinada na instrução ADDI do 0x%08x!
uk: Знакове переповнення в указівці негайного додавання (ADDI) з 0x%08x!

source: Signed overflow in ADD instruction from 0x%08x!
es_es: ¡Desbordamiento con signo en la instruccion ADD de 0x%08x!
pt_br: Sobrecarga assinada na instrução ADD do 0x%08x!
uk: Знакове переповнення в указівці додавання (ADD) з 0x%08x!

source: Signed overflow in SUB instruction from 0x%08x!
es_es: ¡Desbordamiento con signo en la instruccion SUB de 0x%08x!
pt_br: Sobrecarga assinada na instrução SUB do 0x%08x!
uk: Знакове переповнення в указівці віднімання (SUB) з 0x%08x!

source: Attempted unaligned JR to 0x%08x from 0x%08x, firing exception!
es_es: Intento de JR no alineada a 0x%08x desde 0x%08x, ¡provocando excepción!
pt_br: Tentativa de JR desalinhado pra 0x%08x do 0x%08x, disparando exceção!
uk: Cпроба нерівного JR до 0x%08x з 0x%08x, викликано виняток!

source: Attempted unaligned JALR to 0x%08x from 0x%08x, firing exception!
es_es: Intento de JALR no alineada desde 0x%08x a 0x%08x, ¡provocando excepción!
pt_br: Tentativa de JALR desalinhado pro 0x%08x do 0x%08x, disparando exceção!
uk: Cпроба нерівного JALR до 0x%08x з 0x%08x, викликано виняток!

source: Unaligned address 0x%08x in LH from 0x%08x
es_es: Dirección 0x%08x no alineada en LH de 0x%08x
pt_br: Endereço desalinhado 0x%08x em LH do 0x%08x
uk: Нерівна адреса 0x%08x в LH із 0x%08x.

source: Unaligned address 0x%08x in LHU from 0x%08x
es_es: Dirección 0x%08x no alineada en LHU de 0x%08x
pt_br: Endereço desalinhado 0x%08x em LHU do 0x%08x
uk: Нерівна адреса 0x%08x в LHU з 0x%08x.

source: Unaligned address 0x%08x in LW from 0x%08x
es_es: Dirección 0x%08x no alineada en LW de 0x%08x
pt_br: Endereço desalinhado 0x%08x no LW do 0x%08x
uk: Нерівна адреса 0x%08x в LW з 0x%08x.

source: Unaligned address 0x%08x in SH from 0x%08x
es_es: Dirección 0x%08x no alineada en SH de 0x%08x
pt_br: Endereço desalinhado 0x%08x em SH do 0x%08x
uk: Нерівна адреса 0x%08x в SH із 0x%08x.

source: Unaligned address 0x%08x in SW from 0x%08x
es_es: Dirección 0x%08x no alineada en SW de 0x%08x
pt_br: Endereço desalinhado 0x%08x no SW do 0x%08x
uk: Нерівна адреса 0x%08x в SW з 0x%08x.

source: Encountered reserved opcode from 0x%08x, firing an exception
es_es: Encontrado un opcode reservado en 0x%08x, provocando excepción.
pt_br: Encontrou um opcode reservado do 0x%08x, disparando uma exceção
uk: Виявлено зарезервований код операції з 0x%08x, викликано виняток.

source: Attempted to use an invalid floating point instruction from 0x%08x. Ignored.
es_es: Se ha intentado utilizar una instrucción de coma flotante no válida desde 0x%08x. Ignorando.
pt_br: Tentativa de usar uma instrução de ponto flutuante inválida do 0x%08x. Ignorado.
uk: Спроба використання недійсної вказівки з рухомою комою з 0x%08x. Проігноровано.

source: Attempted to access COP3 from 0x%08x. Ignored
es_es: Se ha intentado acceder a COP3 desde 0x%08x. Ignorando.
pt_br: Tentativa de acessar a COP3 do 0x%08x. Ignorado
uk: Спроба доступу до COP3 з 0x%08x. Проігноровано.

source: SharedMem failed to share memory for wram, falling back to memory alloc
es_es: SharedMem no ha podido compartir memoria para la wram, utilizando asignación de memoria como método de reserva
uk: Не вдалося поширити загальну пам'ять для wram, повернення до розподілу пам'яті.

source: Error allocating memory!
es_es: ¡Error al asignar memoria!
fr: Erreur d'allocation de mémoire !
pt_br: Erro ao alocar a memória!
uk: Помилка розподілу пам'яті!

source: Could not open EXP1:"%s".
es_es: No se ha podido abrir EXP1:"%s".
uk: Неможливо відкрити EXP1: "%s".

source: Loaded %i bytes to EXP1 from file: %s
es_es: Se han cargado en EXP1 %i bytes del archivo: %s
uk: Завантажено %i байт до EXP1 з файлу: %s.

source: No BIOS loaded, emulation halted. Set a BIOS file into the configuration, and do a hard reset of the emulator. The distributed OpenBIOS.bin file can be an appropriate BIOS replacement.
es_es: No se ha cargado una BIOS, emulación detenida. Elige un archivo de BIOS en la configuración y luego haz un reinicio completo de la emulación. El archivo distribuido OpenBIOS.bin podría ser una BIOS alternativa ideal.
pt_br: Nenhuma BIOS carregada, emulação interrompida. Defina um arquivo de BIOS na configuração e faça uma reset rígido do emulador. O arquivo OpenBIOS.bin distribuído.bin pode ser um substituto apropriado da BIOS.
uk: BIOS не завантажено, емуляцію зупинено. Встанови BIOS у конфігурації та виконай апаратне перезавантаження емулятора. Поширений OpenBIOS.bin може бути відповідною заміною BIOS.

source: Could not open BIOS:"%s". Retrying with the OpenBIOS
es_es: No se ha podido abrir la BIOS «%s». Reintentando con OpenBIOS.
pt_br: Não pôde abrir a BIOS:"%s". Tentando de novo com a OpenBIOS
uk: Неможливо відкрити BIOS: "%s". Повторна спроба з OpenBIOS.

source: Could not open OpenBIOS fallback. Things won't work properly. Add a valid BIOS in the configuration and hard reset.
es_es: No se ha podido abrir el respaldo de OpenBIOS. La emulación no funcionará correctamente. Introduce una BIOS válida en la configuración y haz un reinicio completo del emulador.
pt_br: Não pôde abrir a reserva da OpenBIOS. As coisas não funcionarão apropriadamente. Adicione uma BIOS válida na configuração e no reset rígido.
uk: Неможливо відкрити резервний OpenBIOS. Усе працюватиме неналежно. Додай дійсний BIOS до конфігурації та перезавантаж апаратно.

source: Loaded BIOS: %s
es_es: Se ha cargado la BIOS: %s
fr: BIOS chargé :%s
pt_br: BIOS carregada: %s
uk: Завантажено BIOS: %s.

source: Known BIOS detected: %s (%08x)
es_es: Se ha detectado una BIOS conocida: %s (%08x)
pt_br: BIOS conhecida detectada: %s (%08x)
uk: Виявлено відомий BIOS: %s (%08x).

source: OpenBIOS detected (%08x)
es_es: Se ha detectado una OpenBIOS (%08x)
pt_br: OpenBIOS detectada (%08x)
uk: Виявлено OpenBIOS (%08x).

source: Unknown bios loaded (%08x)
es_es: Se ha cargado una BIOS desconocida (%08x)
pt_br: Bios desconhecida carregada (%08x)
uk: Завантажено невідомий BIOS (%08x).

source: 8-bit read from usable but uninitialized msan memory: %8.8lx
es_es: Lectura de 8 bits desde memoria msan utilizable, pero sin inicializar: %8.8lx
uk: 8-бітне читання з придатної невизначеної MSAN-пам'яті: %8.8lx.

source: 8-bit read from unusable msan memory: %8.8lx
es_es: Lectura de 8 bits desde memoria msan no utilizable: %8.8lx
uk: 8-бітне читання з непридатної MSAN-пам'яті: %8.8lx.

source: 8-bit read from unknown address: %8.8lx
es_es: Lectura de 8 bits desde dirección desconocida: %8.8lx
uk: 8-бітне читання з невідомої адреси: %8.8lx.

source: 16-bit read from usable but uninitialized msan memory: %8.8lx
es_es: Lectura de 16 bits desde memoria msan utilizable, pero sin inicializar: %8.8lx
uk: 16-бітне читання з придатної невизначеної MSAN-пам'яті: %8.8lx.

source: 16-bit read from unusable msan memory: %8.8lx
es_es: Lectura de 16 bits desde memoria msan no utilizable: %8.8lx
uk: 16-бітне читання з непридатної MSAN-пам'яті: %8.8lx.

source: 16-bit read from unknown address: %8.8lx
es_es: Lectura de 16 bits desde dirección desconocida: %8.8lx
uk: 16-бітне читання з невідомої адреси: %8.8lx.

source: 32-bit read from usable but uninitialized msan memory: %8.8lx
es_es: Lectura de 32 bits desde memoria msan utilizable, pero sin inicializar: %8.8lx
uk: 32-бітне читання з придатної невизначеної MSAN-пам'яті: %8.8lx.

source: 32-bit read from unusable msan memory: %8.8lx
es_es: Lectura de 32 bits desde memoria msan no utilizable: %8.8lx
uk: 32-бітне читання з непридатної MSAN-пам'яті: %8.8lx.

source: 32-bit read from unknown address: %8.8lx
es_es: Lectura de 32 bits desde dirección desconocida: %8.8lx
uk: 32-бітне читання з невідомої адреси: %8.8lx.

source: 8-bit write to unusable msan memory: %8.8lx
es_es: Escritura de 8 bits a memoria msan no utilizable: %8.8lx
uk: 8-бітний запис із непридатної MSAN-пам'яті: %8.8lx.

source: 8-bit write to unknown address: %8.8lx
es_es: Escritura de 8 bits a dirección desconocida: %8.8lx
uk: 8-бітний запис із невідомої адреси: %8.8lx.

source: 16-bit write to unusable msan memory: %8.8lx
es_es: Escritura de 16 bits a memoria msan no utilizable: %8.8lx
uk: 16-бітний запис із непридатної MSAN-пам'яті: %8.8lx.

source: 16-bit write to unknown address: %8.8lx
es_es: Escritura de 16 bits a dirección desconocida: %8.8lx
uk: 16-бітний запис із невідомої адреси: %8.8lx.

source: 32-bit write to unusable msan memory: %8.8lx
es_es: Escritura de 32 bits a memoria msan no utilizable: %8.8lx
uk: 32-бітний запис із непридатної MSAN-пам'яті: %8.8lx.

source: Unknown BIU value: %8.8lx
es_es: Valor BIU desconocido: %8.8lx
uk: Невідоме значення BIU %8.8lx.

source: 32-bit write to unknown address: %8.8lx
es_es: Escritura de 32 bits a dirección desconocida: %8.8lx
uk: 32-бітний запис із невідомої адреси: %8.8lx.
