Repository: grumpycoders/pcsx-redux
Catalog: i18n/*.po
Languages: es_es, fr, pt_br, uk

source: An update is available. Click 'Update' to download it. While the update can be downloaded, it won't be applied automatically. You will have to install it manually, the way you previously did. PCSX-Redux will quit once the update is downloaded. Click 'Download' to use your browser to download the update and manually apply it.
es_es: Hay una actualización disponible. Haz clic en «Actualizar» para descargarla. Esta actualización no se aplicará automáticamente, sino que tendrás que instalarla de forma manual, como ya has hecho antes. PCSX-Redux se cerrará automáticamente una vez se haya descargado la actualización. Pulsa en «Descargar» para obtener la actualización con tu navegador web y aplicarla manualmente.
pt_br: Uma atualização está disponível. Clique em "Atualização" pra baixá-la. Enquanto a atualização é baixada ela não será aplicada automaticamente. Você terá que instalá-la manualmente da maneira que você fez anteriormente. O PCSX-Redux fechará uma vez que a atualização for baixada. Clique em "Download" pra usar seu navegador pra baixar a atualização e aplicá-la manualmente.
uk: Оновлення доступне. Натисни "Оновити" для завантаження. Хоча оновлення можна завантажити, його не буде встановлено автоматично. Необхідно ручне встановлення, як і раніше. PCSX-Redux буде закрито після завантаження оновлення. Натисни "Завантажити" для завантаження оновлення з браузера та ручного встановлення.

source: Update
es_es: Actualizar
pt_br: Atualização
uk: Оновити

source: An error has occured while downloading and/or applying the update.
es_es: Ha habido un error al descargar o aplicar la actualización.
pt_br: Um erro ocorreu enquanto baixava e/ou aplicava a atualização.
uk: Помилка завантаження та / або встановлення оновлення.

source: Download
es_es: Descargar
uk: Завантажити

source: An error has occured while downloading the update.
es_es: Ha habido un error al descargar la actualización.
pt_br: Um erro ocorreu enquanto baixava a atualização.
uk: Помилка завантаження оновлення.

source: Cancel
es_es: Cancelar
fr: Annuler
pt_br: Cancelar
uk: Скасувати

source: UvFiles
pt_br: Arquivos Uv
uk: Uv-файли

source: Read rate: %s
es_es: Tasa de lectura: %s
pt_br: Taxa de leitura: %s
uk: Швидкість читання: %s.

source: Write rate: %s
es_es: Tasa de escritura: %s
pt_br: Taxa de gravação: %s
uk: Швидкість запису: %s.

source: Download rate: %s
es_es: Velocidad de descarga: %s
pt_br: Taxa de download: %s
uk: Швидкість завантаження: %s.

source: Caching
es_es: Caché
pt_br: Cache
uk: Кешування

source: Filename
es_es: Nombre de archivo
pt_br: Nome do arquivo
uk: Ім'я файлу

source: Emulation Configuration
es_es: Configuración de emulación
fr: Configuration de l'Emulation
pt_br: Configuração da Emulação
uk: Конфігурація емуляції

source: Idle Swap Interval
es_es: Intervalo de intercambio de inactividad
pt_br: Intervalo da Troca Inativa
uk: Інтервал обміну неактивності

source: Reset Scaler
es_es: Reiniciar escalador
pt_br: Resetar o Escalador
uk: Відновити скалер

source: Speed Scaler
es_es: Escalador de velocidad
pt_br: Escalador da Velocidade
uk: Швидкість скалера

source: Enable XA decoder
es_es: Activar decodificador XA
fr: Activer le décodeur XA
pt_br: Ativar o decodificador XA
uk: Увімкнути XA-декодер

source: Always enable SPU IRQ
es_es: Activar siempre las IRQ de la SPU
fr: Toujours activer l'IRQ du SPU
pt_br: Sempre ativar o IRQ do SPU
uk: Завжди вмикати СП IRQ

source: Decode MDEC videos in B&W
es_es: Decodificar vídeos MDEC en blanco y negro
fr: Décoder les vidéos MDEC en N&B
pt_br: Decodificar vídeos MDEC em P&B
uk: Декодувати MDEC-відео до монохрому

source: Dynarec CPU
es_es: CPU DynaRec
pt_br: CPU do Dynarec
uk: Динамічна перекомпіляція ЦП

source: Activates the dynamic recompiler CPU core. It is significantly faster than the interpreted CPU, however it doesn't play nicely with the debugger. Changing this setting requires a reboot to take effect. The dynarec core isn't available for all CPUs, so this setting may not have any effect for you.
es_es: Activa el núcleo del recompilador dinámico de la CPU. Es considerablemente más rápido que la CPU interpretada, pero no funciona bien con el depurador. Es necesario reiniciar para que los cambios en este ajuste tengan efecto. El núcleo dynarec no está disponible para todas las CPU, por lo que este ajuste podría no cambiar nada en tu caso.
pt_br: Ativa o núcleo da CPU do recompilador dinâmico. É significativamente mais rápido do que a CPU interpretada, contudo ele não funciona bem com o debugger. Mudar esta configuração requer uma reinicialização pra ter efeito. O núcleo do dynarec não está disponível pra todas as CPUs então esta configuração pode não ter qualquer efeito pra você.
uk: Активація ядра динамічного перекомпілятора ЦП. Значно швидше, ніж інтерпретований ЦП, однак погано працює з налагоджувачем. Зміна налаштування відбудеться після перезавантаження. Ядро динамічної перекомпіляції доступне не для всіх ЦП, тому налаштування може не мати жодного ефекту.

source: 8MB
pt_br: 8 MBs
uk: 8 Мбайт

source: Emulates an installed 8MB system, instead of the normal 2MB. Useful for working with development binaries and games.
es_es: Emula un sistema con 8 MB instalados en vez de 2 MB, que es lo normal. Ideal para versiones en desarrollo de binarios y juegos.
pt_br: Emula um sistema de 8 MBs instalado ao invés dos 2 MBs normais. Útil pra trabalhar com binários e jogos em desenvolvimento.
uk: Емуляція встановленої системи 8 Мбайт замість звичайних 2 Мбайт. Корисно для роботи з виробничими двійковими файлами й іграми.

source: OpenGL GPU *ALPHA STATE*
es_es: GPU por OpenGL *EN ESTADO PRELIMINAR/ALFA*
pt_br: GPU do OpenGL *ESTADO ALFA*
uk: ГП Open GL *АЛЬФА-СТАН*

source: Enables the OpenGL GPU renderer. This is not recommended for normal use at the moment, as it is not fully implemented yet. It is recommended to use the software renderer instead. Requires a restart when changing this setting.
es_es: Activa el renderizador OpenGL mediante la GPU. No se recomienda su uso habitual en estos momentos porque no está implementado por completo. En su lugar, se recomienda utilizar el renderizador por software. Es necesario reiniciar al cambiar este ajuste.
pt_br: Ativa o renderizador da GPU do OpenGL. Isto não é recomendado pra uso normal no momento, como ainda não está totalmente implementado. É recomendado usar o renderizador de software ao invés disto. Requer uma reinicialização quando mudar esta configuração.
uk: Увімкнення ГП-опрацьовувача Open GL. Не рекомендовано для звичайного використання, оскільки ще не повністю реалізовано. Натомість рекомендовано використовувати програмний опрацьовувач. Необхідне перезавантаження при зміні налаштування.

source: System Type
es_es: Tipo de sistema
fr: Type de système
pt_br: Tipo de Sistema
uk: Тип системи

source: Fast boot
es_es: Arranque rápido
fr: Démarrage rapide
pt_br: Inicialização rápida
uk: Швидке завантаження

source: This will cause the BIOS to skip the shell, which may include additional checks. Also will make the boot time substantially faster by not displaying the logo.
es_es: Esta opción omitirá el shell de la BIOS, el cual podría contener comprobaciones adicionales. También reducirá considerablemente el tiempo de arranque al no mostrar el logotipo.
pt_br: Isto fará com que a BIOS ignore o shell o qual pode incluir verificações adicionais. Também tornará o tempo de inicialização substancialmente mais rápido por não exibir o logo.
uk: Пропуск BIOS оболонки з урахуванням додаткових перевірок. Також час завантаження буде суттєво прискорено, оскільки логотип не буде відображено.

source: BIOS file
es_es: Archivo de BIOS
fr: Fichier du BIOS
pt_br: Arquivo da BIOS
uk: BIOS

source: Enable Debugger
es_es: Activar depurador
pt_br: Ativar Debugger
uk: Увімкнути налагоджувач

source: This will enable the usage of various breakpoints throughout the execution of mips code. Enabling this can slow down emulation to a noticeable extent.
es_es: Esta opción activará el uso de varios puntos de interrupción durante la ejecución del código MIPS. Podría ralentizar la emulación en gran medida.
uk: Використання різних точок зупинки при виконанні MIPS-коду. Можливе значне сповільнення емуляції.

source: Enable GDB Server
es_es: Activar servidor GDB
pt_br: Ativar o Servidor GDB
uk: Увімкнути GDB-сервер

source: This will activate a gdb-server that you can connect to with any gdb-remote compliant client. You also need to enable the debugger.
es_es: Esta opción activará un servidor GDB al que podrás conectarte desde cualquier cliente compatible con gdb-remote. Es necesario activar también el depurador.
pt_br: Isto ativará um servidor gdb que você pode conectar com qualquer cliente compatível com gdb-remoto. Você também precisa ativar o debugger.
uk: Активація GDB-сервера, з яким можливе з'єднання будь-яким GDB-remote-сумісним клієнтом. Також необхідно увімкнути налагоджувач.

source: GDB send manifest
es_es: Enviar manifiesto por GDB
pt_br: Manifesto do Envio do GDB
uk: Маніфест надсилання GDB

source: Enables sending the processor's manifest from the gdb server. Keep this enabled, unless you want to connect IDA to this server, as it has a bug in its manifest parser.
es_es: Activa la transmisión del manifiesto del procesador desde el servidor GDB. Mantén esta opción activada a menos que quieras conectar el programa IDA a este servidor, ya que IDA tiene un defecto en su analizador de manifiestos.
pt_br: Ativa o envio do manifesto do processador do servidor gdb. Mantenha isto ativado a menos que você queira conectar o IDA a este servidor pois ele tem um bug em seu analisador de manifesto.
uk: Надсилання маніфесту процесора з GDB-сервера. Залиш увімкненим для нез'єднання IDA з сервером, оскільки він має помилку в аналізаторі маніфесту.

source: PCSX Logs to GDB
es_es: Enviar registros de PCSX a GDB
pt_br: Registros do PCSX pro GDB
uk: Журнали PCSX до GDB

source: GDB Server Port
es_es: Puerto de servidor GDB
pt_br: Porta do Servidor GDB
uk: Порт GDB-сервера

source: GDB Server Trace
es_es: Seguimiento del servidor GDB
pt_br: Rastro do Servidor GDB
uk: Відстеження GDB-сервера

source: The GDB server will start tracing its protocol into the logs, which can be helpful to debug the gdb server system itself.
es_es: El servidor GDB comenzará a escribir en los registros un seguimiento de su protocolo. Esto puede servir para depurar el sistema del servidor GDB.
pt_br: O servidor GDB começará a rastrear seu protocolo nos registros o que pode ser útil pra fazer debug do próprio sistema do servidor gdb.
uk: GDB-сервером буде розпочато відстеження протоколу в журналах, що може бути корисним для налагодження самої системи GDB-сервера.

source: Enable Web Server
es_es: Activar servidor web
pt_br: Ativar o Servidor da Web
uk: Увімкнути web-сервер

source: This will activate a web-server, that you can query using a REST api. See the wiki for details. The debugger might be required in some cases.
es_es: Esta opción activará un servidor web que podrás consultar mediante una API REST. Encontrarás más información en la wiki. En algunos casos podrías necesitar que el depurador esté activado.
pt_br: Isto ativará um servidor da web que você pode consultar usando uma api REST. Veja o wiki pra mais detalhes. O debugger poderia ser requerido em alguns casos.
uk: Активація web-сервера, до якого можливі запити REST API (передача стану представлення). Докладно - Wikipedia. У деяких випадках необхідний налагоджувач.

source: Web Server Port
es_es: Puerto del servidor web
pt_br: Porta do Servidor da Web
uk: Порт web-сервера

source: Enable SIO1 Server
es_es: Activar servidor SIO1
pt_br: Ativar o Servidor SIO1
uk: Увімкнути SIO1-сервер

source: This will activate a tcp server, that will relay information between tcp and sio1. See the wiki for details.
es_es: Esta opción activará un servidor TCP que transmitirá información entre el protocolo TCP y SIO1. Encontrarás más información en la wiki.
pt_br: Isto ativará um servidor tcp que retransmitirá informações entre o tcp e sio1. Veja o wiki pra mais detalhes.
uk: Активація TCP-сервера для передачі відомостей між TCP і SIO1. Докладно - Wikipedia.

source: SIO1 Server Port
es_es: Puerto del servidor de SIO1
pt_br: Porta do Servidor SIO1
uk: Порт SIO1-сервера

source: Enable SIO1 Client
es_es: Activar cliente SIO1
pt_br: Ativar o Cliente SIO1
uk: Увімкнути SIO1-клієнт

source: This will activate a tcp client, that can connect to another PCSX-Redux server to relay information between tcp and sio1. See the wiki for details.
es_es: Esta opción activará un cliente TCP que puede conectarse a otro servidor de PCSX-Redux y transmitir información entre el protocolo TCP y SIO1. Encontrarás más información en la wiki.
pt_br: Isso ativará um cliente tcp que pode conectar com outro servidor do PCSX-Redux pra retransmitir informações entre o tcp e sio1. Veja o wiki para mais detalhes.
uk: Активація TCP-клієнта для з'єднання з іншим сервером PCSX-Redux для передачі відомостей між TCP і SIO1. Докладно - Wikipedia.

source: SIO1 Client Host
es_es: Host del cliente SIO1
pt_br: Hospedeiro do cliente SIO1
uk: Хост SIO1-клієнта

source: SIO1 Client Port
es_es: Puerto del cliente SIO1
pt_br: Porta do Cliente SIO1
uk: Порт SIO1-клієнта

source: Reset SIO
es_es: Reiniciar SIO
pt_br: Resetar o SIO
uk: Перезавантажити SIO

source: Reconnect
es_es: Volver a conectar
pt_br: Reconectar
uk: Перез'єднати

source: SIO1Mode
pt_br: Modo SIO1
uk: SIO1-режим

source: Interrupt Scaler
es_es: Escalador de interrupciones
pt_br: Escalador da Interrupção
uk: Скалер переривань

source: Reset all
es_es: Reiniciar todo
pt_br: Resetar tudo
uk: Відновити все

source: Cherry##Theme name
es_es: Rojo cereza##Theme name
uk: Вишня##Ім'я теми

source: Classic##Theme name
es_es: Clásico##Theme name
uk: Класична##Ім'я теми

source: Default theme##Theme name
es_es: Tema predeterminado##Theme name
uk: Типова##Ім'я теми

source: Light##Theme name
es_es: Claro##Theme name
uk: Світло##Ім'я теми

source: Dracula##Theme name
es_es: Drácula##Theme name
uk: Дракула##Ім'я теми

source: Mono##Theme name
uk: Моно##Ім'я теми

source: Olive##Theme name
es_es: Oliva##Theme name
uk: Олива##Ім'я теми

source: Themes
es_es: Temas
pt_br: Temas
uk: Теми

source: Version
es_es: Versión
pt_br: Versão
uk: Версія

source: No version information. Probably built from source.
es_es: No hay información sobre la versión. Probablemente haya sido compilada a partir de los archivos fuente.
pt_br: Nenhuma informação da versão. Provavelmente construído da fonte.
uk: Відсутні відомості версії. Імовірно, зібрано з джерела.

source: Copy to clipboard
es_es: Copiar al portapapeles
pt_br: Copiar pra área de transferência
uk: Копіювати до буфера обміну

source: Version: %s
es_es: Versión: %s
pt_br: Versão: %s
uk: Версія: %s

source: Build: %i
es_es: Compilación: %i
uk: Випуск: %i

source: Changeset:
es_es: Conjunto de cambios:
uk: Набір змін:

source: Date & time: %s
es_es: Fecha y hora: %s
pt_br: Data & hora: %s
uk: Дата та час: %s

source: Authors
es_es: Autores
pt_br: Autores
uk: Автори

source: Licenses
es_es: Licencias
pt_br: Licenças
uk: Ліцензії

source: OpenGL information
es_es: Información sobre OpenGL
fr: Information sur l'OpenGL
pt_br: Informações do OpenGL
uk: Відомості Open GL

source: OpenGL error reporting: enabled
es_es: Informe de errores de OpenGL: activado
pt_br: Relatório de erros do OpenGL: ativado
uk: Увімкнено звітність помилок Open GL.

source: OpenGL error reporting: disabled
es_es: Informe de errores de OpenGL: desactivado
pt_br: Relatório de erros do OpenGL: desativado
uk: Вимкнено звітність помилок Open GL.

source: OpenGL error reporting has been disabled because your OpenGL driver is too old. Error reporting requires at least OpenGL 4.3. Please update your graphics drivers, or contact your GPU vendor for up to date OpenGL drivers. Disabled OpenGL error reporting won't have a negative impact on the performance of this software, but user code such as the shader editor won't be able to properly report problems accurately.
es_es: Se ha desactivado el informe de errores de OpenGL porque tu controlador de OpenGL es demasiado antiguo. Los informes de errores requieren, como mínimo, de la versión 4.3 de Open GL. Recomendamos actualizar los controladores de tu tarjeta gráfica o contactar con el fabricante de tu GPU para obtener los controladores más recientes para OpenGL. Desactivar los informes de errores de OpenGL no afectará de forma negativa al rendimiento de este software, pero ciertos códigos personalizados, como el editor de shaders, no podrán informar debidamente de cualquier problema que pueda ocurrir.
uk: Звітність помилок Open GL вимкнено. Драйвер дуже старий, необхідно Open GL 4.3+. Онови графічні драйвери чи зв'яжися з постачальником ГП для отримання найновіших драйверів. Вимкнення не матиме негативного впливу на продуктивність програмного забезпечення, але код користувача, наприклад, редактор шейдерів, не зможе належно точно повідомляти проблеми.

source: Enable OpenGL error reporting
es_es: Activar informe de errores de OpenGL
pt_br: Ativar o relatório de erros do OpenGL
uk: Увімкнути звітність помилок Open GL

source: OpenGL error reporting is necessary for properly reporting OpenGL problems. However it requires OpenGL 4.3+ and might have performance repercussions on some computers. (Requires a restart of the emulator)
es_es: El informe de errores de OpenGL es necesario para poder informar debidamente de cualquier problema que pueda ocurrir con OpenGL. Sin embargo, es necesaria la versión 4.3 o superior de OpenGL y esto podría afectar al rendimiento de algunos equipos (es necesario reiniciar el emulador).
pt_br: O relatório de erros do OpenGL é necessário pra reportar os problemas do OpenGL apropriadamente. Contudo ele requer OpenGL 4.3+ e poderia ter repercussões na performance em alguns computadores. (Requer reiniciar o emulador)
uk: Звітність помилок OpenGL необхідна для правильного звітності проблем. Однак, необхідний Open GL 4.3+, і можливий вплив на продуктивність деяких комп'ютерів (необхідний перезапуск емулятора).

source: OpenGL error reporting severity
es_es: Gravedad de los informes de errores de OpenGL
pt_br: Severidade do relatório de erros do OpenGL
uk: Ретельність звітності помилок Open GL

source: Core profile: %s
es_es: Perfil de núcleo: %s
pt_br: Perfil do núcleo: %s
uk: Профіль ядра: %s.

source: no
pt_br: não
uk: ні

source: yes
es_es: sí
pt_br: sim
uk: так

source: Vendor
es_es: Proveedor
pt_br: Vendedor
uk: Виробник

source: Renderer
es_es: Renderizador
pt_br: Renderizador
uk: Опрацьовувач

source: Shading language version
es_es: Versión del lenguaje de shaders
pt_br: Versão do idioma do shader
uk: Версія мови шейдера

source: Texture units: %d
es_es: Unidades de textura: %d
uk: Блоки текстур: %d

source: Extensions:
es_es: Extensiones:
pt_br: Extensões:
uk: Розширення:

source: FFmpeg information
es_es: Información sobre FFmpeg
uk: FFmpeg-відомості

source: License: %s
es_es: Licencia: %s
uk: Ліцензія: %s.

source: Configuration: %s
es_es: Configuración: %s
uk: Конфігурація: %s.

source: List of supported formats:
es_es: Lista de formatos admitidos:
uk: Перелік підтримуваних форматів:

source: List of supported codecs: (D: Decoder, E: Encoder, L: Lossy, S: Lossless)
es_es: Lista de códecs admitidos: (D: decodificación, E: codificación, L: sin pérdida, S: con pérdida)
uk: Перелік підтримуваних кодеків: (D: Декодер, E: Кодувальник, L: Утратно, S: Без утрат)

source: %s codecs
es_es: %s códecs
uk: %s-кодеки

source: Notification
es_es: Notificación
pt_br: Notificação
uk: Сповіщення

source: Offscreen CRT shader Configuration
es_es: Configuración del shader CRT para fuera de pantalla
pt_br: Configuração do Shader Fora da Tela do CRT
uk: Конфігурація позакадрових CRT-шейдерів

source: Enable gaussian blur
es_es: Activar desenfoque gausiano
pt_br: Ativar desfoque gaussiano
uk: Увімкнути гаусівське розмиття

source: Hard Pixel factor
es_es: Factor fijo de píxeles
pt_br: Fator dos Pixels Rígidos
uk: Фактор жорстких пікселів

source: Hard Scanline factor
es_es: Factor fijo de líneas de barrido
pt_br: Fator dos Scanlines Rígidos
uk: Фактор жорстких рядків сканування

source: Enable Scanlines
es_es: Activar líneas de barrido
pt_br: Ativar Scanlines
uk: Увімкнути рядки сканування

source: Use S-rgb
es_es: Utilizar S-RGB
pt_br: Usar S-RGB
uk: Використовувати S-RGB

source: Reset to defaults
es_es: Restaurar predeterminados
pt_br: Resetar para os padrões
uk: Відновити типові

source: Output CRT Shader Configuration
es_es: Configuración del shader CRT de salida
pt_br: Configuração do Shader de Saída do CRT
uk: Конфігурація кінцевих CRT-шейдерів

source: Warp intensity
es_es: Intensidad de la deformación
pt_br: Intensidade do Warp
uk: Інтенсивність кривих

source: Mask intensity
es_es: Intensidad de la máscara
pt_br: Intensidade da Máscara
uk: Інтенсивність маски

source: Greyscale
es_es: Escala de grises
pt_br: Escala de cinza
uk: Відтінки сірого

source: Trinitron
uk: Тринітрон

source: Trinitron 2x
es_es: Trinitron x2
uk: Тринітрон 2x

source: Trio
uk: Тріо

source: Mask type
es_es: Tipo de máscara
pt_br: Tipo de máscara
uk: Тип маски

source: Go to in Memory Editor #1 (Default Click)
es_es: Ver en editor de memoria 1 (clic predeterminado)
uk: Перейти до редактора пам'яті 1 (типове натискання)

source: Go to in Memory Editor #2 (Shift+Click)
es_es: Ver en editor de memoria 2 (Mayús + clic)
uk: Перейти до редактора пам'яті 2 (Shift + натискання)

source: Go to in Memory Editor #3 (Ctrl+Click)
es_es: Ver en editor de memoria 3 (Ctrl + clic)
uk: Перейти до редактора пам'яті 3 (Ctrl + натискання)

source: Go to in Memory Editor #{}
es_es: Ver en editor de memoria {}
uk: Перейти до редактора пам'яті #{}

source: Create Memory Read Breakpoint
es_es: Crear punto de interrupción de lectura en memoria
uk: Створити точку зупинки читання пам'яті

source: GUI
es_es: Interfaz de usuario
uk: Графічний інтерфейс користувача

source: Create Memory Write Breakpoint
es_es: Crear punto de interrupción de escritura a memoria
uk: Створити точку зупинки запису пам'яті

source: Go to in Memory Editor...
es_es: Ver en editor de memoria...
uk: Перейти до редактора пам'яті...

source: Go to in Memory Editor #%d
es_es: Ver en editor de memoria %d
uk: Перейти до редактора пам'яті %d

source: Go to in Memory Editor #%u
es_es: Ver en editor de memoria %u
uk: Перейти до редактора пам'яті %u

source: Load symbols map
es_es: Cargar mapa de símbolos
fr: Charger les symboles de la map
pt_br: Carregar o mapa dos símbolos
uk: Завантажити мапу символів

source: Reset symbols map
es_es: Reiniciar mapa de símbolos
pt_br: Resetar o mapa dos símbolos
uk: Відновити мапу символів

source: Pause
es_es: Pausar
pt_br: Pausar
uk: Призупинити

source: Resume
es_es: Reanudar
fr: Reprendre
pt_br: Resumo
uk: Продовжити

source: Step In
es_es: Avanzar una
pt_br: Intervir
uk: Увійти

source: Options
es_es: Opciones
pt_br: Opções
uk: Опції

source: Combined pseudo-instructions
es_es: Combinar seudoinstrucciones
fr: Pseudo-instructions combinées
pt_br: Pseudo-instruções combinadas
uk: Об'єднані псевдовказівки

source: When two instructions are detected to be a single pseudo-instruction, combine them into the actual pseudo-instruction.
es_es: Cuando se detecte que dos instrucciones son una misma seudoinstrucción, se combinarán para mostrar la seudoinstrucción real.
fr: Quand deux instructions sont détectées comme étant une seule pseudo-instruction, les combiner dans l'actuelle pseudo-instruction.
pt_br: Quando duas instruções são detectadas como sendo uma única pseudo-instrução combine-as na pseudo-instrução real.
uk: При виявленні двох указівок як однієї псевдовказівки, об'єднай їх до справжньої псевдовказівки.

source: Pseudo-instructions filling
es_es: Rellenar seudoinstrucciones
pt_br: Preenchimento das pseudo-instruções
uk: Заповнення псевдовказівок
