Repository: grumpycoders/pcsx-redux
Catalog: i18n/*.po
Languages: es_es, fr, pt_br, uk

source: Moved file {}({}) from card {} to card {}
es_es: Se ha trasladado el archivo {}({}) de la tarjeta {} a la tarjeta {}
pt_br: Movido o arquivo {}({}) do cartão {} pro cartão {}
uk: Переміщено файл {}({}) із карти {} до карти {}.

source: Export PNG##{}
es_es: Exportar PNG##{}
pt_br: Exportar PNG##{}
uk: Експортувати PNG##{}

source: Copy icon##{}
es_es: Copiar icono##{}
pt_br: Ícone da cópia##{}
uk: Копіювати піктограму##{}

source: Memory Card 1
es_es: Tarjeta de memoria 1
uk: Карта пам'яті 1

source: Memory Card 2
es_es: Tarjeta de memoria 2
uk: Карта пам'яті 2

source: Import Memory Card file
es_es: Importar archivo de Memory Card
uk: Імпорт файлу карти пам'яті

source: Export Memory Card file
es_es: Exportar archivo de Memory Card
uk: Експорт файлу карти пам'яті

source: Plain search
es_es: Búsqueda sin formato
pt_br: Busca simples
uk: Простий пошук

source: Pattern
es_es: Patrón
pt_br: Modelo
uk: Шаблон

source: Search
es_es: Buscar
pt_br: Procurar
uk: Шукати

source: Found values
es_es: Valores encontrados
pt_br: Valores achados
uk: Знайдено значення

source: Access
es_es: Acceso
pt_br: Acesso
uk: Доступ

source: Show in memory editor##{}
es_es: Mostrar en editor de memoria##{}
pt_br: Mostrar no editor de memória##{}
uk: Показати в редакторі пам'яті##{}

source: Delta-over-time search
es_es: Búsqueda de delta/tiempo
pt_br: Busca do delta-sobre-o-tempo
uk: Дельта-часовий пошук

source: First scan
es_es: Búsqueda inicial
pt_br: Primeiro escaneamento
uk: Перше сканування

source: Next scan
es_es: Búsqueda siguiente
pt_br: Próximo escaneamento
uk: Наступне сканування

source: New scan
es_es: Nueva búsqueda
pt_br: Novo escaneamento
uk: Нове сканування

source: Value type
es_es: Tipo de valor
pt_br: Tipo de valor
uk: Тип значення

source: Scan type
es_es: Tipo de búsqueda
pt_br: Tipo de escaneamento
uk: Тип сканування

source: Display as fixed-point values
es_es: Mostrar como valores de coma fija
pt_br: Exibir como valores de ponto fixo
uk: Відображати як значення з постійною комою

source: Current value
es_es: Valor actual
pt_br: Valor atual
uk: Поточне значення

source: Scanned value
es_es: Valor buscado
pt_br: Valor escaneado
uk: Скановане значення

source: Read breakpoint
es_es: Interrup. de lectura
pt_br: Ler o Ponto de Interrupção
uk: Читання точки зупинки

source: Write breakpoint
es_es: Interrup. de escritura
pt_br: Gravar Ponto de Interrupção
uk: Запис точки зупинки

source: Freeze##{}
uk: Затримати##{}

source: Add read breakpoint##{}
es_es: Añadir punto de interrupción de lectura##{}
pt_br: Adicionar Ponto de Interrupção da Leitura##{}
uk: Додати читання точки зупинки##{}

source: Add write breakpoint##{}
es_es: Añadir punto de interrupción de escritura##{}
pt_br: Adicionar Ponto de Interrupção da Gravação##{}
uk: Додати запис точки зупинки##{}

source: Pattern search
es_es: Búsqueda de patrones
pt_br: Busca de modelos
uk: Пошук шаблону

source: Sequence size:
es_es: Tamaño de secuencia:
pt_br: Tamanho da sequência:
uk: Розмір послідовності:

source: 8 bytes (fast)
es_es: 8 bytes (rápido)
pt_br: 8 bytes (rápido)
uk: 8 байт (швидко)

source: 16 bytes (fast)
es_es: 16 bytes (rápido)
pt_br: 16 bytes (rápido)
uk: 16 байт (швидко)

source: Arbitrary
es_es: Arbitrario
pt_br: Arbitrário
uk: Довільно

source: Sequence
es_es: Secuencia
pt_br: Sequência
uk: Послідовність

source: Step
es_es: Avanzar
pt_br: Passo
uk: Крок

source: Filename:
es_es: Nombre de archivo:
uk: Ім'я файлу:

source: Enter the name of your save state here
es_es: Introduce el nombre de tu estado de guardado
uk: Укажи ім'я стану збереження.

source: Create save
es_es: Crear estado
uk: Створити збереження

source: Overwrite save
es_es: Sobrescribir estado
uk: Перезаписати збереження

source: Load save
es_es: Cargar estado
uk: Завантажити збереження

source: Delete save
es_es: Eliminar estado
uk: Видалити збереження

source: Patching is only available in Interpreted CPU mode
es_es: Solo se pueden aplicar parches en el modo de CPU interpretada
uk: Виправлення доступне лише в режимі інтерпретованого ЦП.

source: Delete Patch?
es_es: ¿Eliminar el parche?
uk: Видалити виправлення?

source: Return
es_es: Retorno
uk: Повернути

source: Delete all Patches?
es_es: ¿Eliminar todos los parches?
uk: Видалити всі виправлення?

source: Delete##patches
es_es: Eliminar##parches
uk: Видалити##виправлення

source: On/Off Switch:
es_es: Interruptor de encendido:
uk: Перемикач:

source: Off
es_es: Apagado
uk: Вимкнути

source: On
es_es: Encendido
uk: Увімкнути

source: Context##{}
es_es: Contexto##{}
pt_br: Contexto##{}
uk: Контекст##{}

source: Go to in Assembly
es_es: Ver en desensamblador
pt_br: Ir no Assembly
uk: Перейти до збору

source: Go to in Memory Editor
es_es: Ver en editor de memoria
pt_br: Ir no Editor de Memória
uk: Перейти до редактора пам'яті

source: Copy Value
es_es: Copiar valor
pt_br: Copiar Valor
uk: Копіювати значення

source: Edit##{}
es_es: Editar##{}
pt_br: Editar##{}
uk: Редагувати##{}

source: Edit value of {}
es_es: Editar valor de {}
pt_br: Editar valor do {}
uk: Редагувати значення {}

source: Show fixed point
es_es: Mostrar valor de punto fijo
uk: Показати закріплені точки

source: Misc
es_es: Otros
fr: Divers
pt_br: Diversos
uk: Інше

source: Bus Error
es_es: Error de bus
uk: Помилка шини.

source: DMA IRQ Enabled
es_es: IRQ de DMA habilitada
uk: DMA IRQ увімкнено.

source: DMA IRQ Triggered
es_es: IRQ de DMA desencadenada
uk: DMA IRQ викликано.

source: Completion
es_es: Finalización
uk: Завершення

source: IRQ Enabled
es_es: Habilitar IRQ
uk: IRQ увімкнено.

source: Triggered
es_es: Desencadenada
uk: Викликано.

source: Change the value of register %s:
es_es: Cambia el valor del registro %s:
pt_br: Mudar o valor do registro %s:
uk: Змінити значення регістру %s:

source: Register
es_es: Registro
pt_br: Registro
uk: Регістр

source: Vertex Shader compilation error: {}
es_es: Error de compilación de Vertex Shader: {}
pt_br: Erro de compilação do Shader do Vertex: {}
uk: Помилка компіляції вершинного шейдера: {}.

source: Pixel Shader compilation error: {}
es_es: Error de compilación de Pixel Shader: {}
pt_br: Erro de compilação do Shader dos Pixels: {}
uk: Помилка компіляції піксельного шейдера: {}.

source: Link error: {}
es_es: Error de vínculo: {}
pt_br: Erro do link: {}
uk: Помилка зв'язку: {}.

source: Missing attribute {} in shader program
es_es: Falta el atributo {} en la programación del shader
pt_br: Atributo ausente {} no programa do shader
uk: Відсутній атрибут {} у програмі шейдера.

source: Auto compile
es_es: Compilar automáticamente
pt_br: Auto-compilar
uk: Автокомпіляція

source: Show all
es_es: Mostrar todo
pt_br: Mostrar tudo
uk: Показати все

source: Configure shader
es_es: Configurar shader
pt_br: Configurar shader
uk: Налаштувати шейдер

source: Vertex Shader
pt_br: Shader do Vertex
uk: Вершинний шейдер

source: Pixel Shader
pt_br: Shader dos Pixels
uk: Піксельний шейдер

source: Lua Invoker
es_es: Invocador de Lua
pt_br: Invocador do Lua
uk: Lua-викликач

source: Edit
es_es: Editar
pt_br: Editar
uk: Редагувати

source: Bit
uk: Біт

source: Description
es_es: Descripción
pt_br: Descrição
uk: Опис

source: New value
es_es: Valor nuevo
pt_br: Novo valor
uk: Нове значення

source: Status
es_es: Estado
uk: Стан

source: Control
pt_br: Controle
uk: Керування

source: Import data types
es_es: Importar tipos de datos
pt_br: Importar tipos de dados
uk: Імпортувати типи даних

source: Import functions
es_es: Importar funciones
pt_br: Importar funções
uk: Імпортувати функції

source: Log reads and writes##{}{}
es_es: Lecturas y escrituras del registro##{}{}
pt_br: Leituras e gravações dos registros##{}{}
uk: Читання та записи журналів##{}{}

source: Add read breakpoint##{}{}
es_es: Añadir punto de interrupción de lectura##{}{}
pt_br: Adicionar Ponto de Interrupção da Leitura##{}
uk: Додати читання точки зупинки##{}{}

source: ReadPause
pt_br: PausaNaLeitura
uk: Пауза читання

source: Add write breakpoint##{}{}
es_es: Añadir punto de interrupción de escritura##{}{}
pt_br: Adicionar Ponto de Interrupção da Gravação##{}
uk: Додати запис точки зупинки##{}{}

source: WritePause
pt_br: PausaNaGravação
uk: Пауза запису

source: Display log entries##{}{}
es_es: Mostrar entradas del registro##{}{}
pt_br: Exibir entradas do registro##{}{}
uk: Відобразити записи журналу##{}{}

source: Re-enable##{}
es_es: Reactivar##{}
pt_br: Re-ativar##{}
uk: Повторно увімкнути##{}{}

source: Disable##{}
es_es: Desactivar##{}
pt_br: Desativar##{}
uk: Вимкнути##{}{}

source: Show in memory editor##{}{}
es_es: Mostrar en editor de memoria##{}{}
pt_br: Mostrar no editor de memória##{}{}
uk: Показати в редакторі пам'яті##{}{}

source: Add to Watch tab##{}{}
es_es: Añadir a pestaña Inspección##{}{}
pt_br: Adicionar a aba Observar##{}{}
uk: Додати до вкладки "Перегляд"##{}{}

source: New value##{}
es_es: Valor nuevo##{}
pt_br: Novo valor##{}
uk: Нове значення##{}

source: Data types can be imported from Ghidra using tools/ghidra_scripts/export_redux.py, which will generate a redux_data_types.txt file in its folder, or from any text file where each line specifies the data type's name and fields, separated by semi-colons; fields are specified in type-name-size tuples whose elements are separated by commas. For example: ``` CdlLOC;u_char,minute,1;u_char,second,1;u_char,sector,1;u_char,track,1; ``` Arrays are specified as `type[number]` and pointers as `type *`.
es_es: Los tipos de datos se pueden importar de Ghidra mediante el script tools/ghidra_scripts/export_redux.py, el cual generará un archivo llamado redux_data_types.txt en su carpeta; o a partir de cualquier archivo de texto donde cada línea especifique el nombre y los campos del tipo de datos separados por puntos y coma. Los campos se deben especificar como tuplas tipo/nombre/tamaño y sus elementos deben estar separados por comas. Por ejemplo: ``` CdlLOC;u_char,minute,1;u_char,second,1;u_char,sector,1;u_char,track,1; ``` Las matrices se especifican como `type[number]` y los punteros como `type *`.
uk: Імпорт типів даних із Ghidra можливий за використання tools/ghidra_scripts/export_redux.py для генерації файлу redux_data_types.txt у теці чи з будь-якого текстового файлу, де кожен рядок указує ім'я типу даних і поля, розділені крапкою з комою; поля вказано в кортежах тип-ім'я-розмір, елементи яких розділено комами. Наприклад: ``` CdlLOC;u_char,minute,1;u_char,second,1;u_char,sector,1;u_char,track,1; ``` Масиви вказано як `type[number]` і вказівник як `type *`.

source: Functions can be imported from Ghidra using tools/ghidra_scripts/export_redux.py, which will generate a redux_funcs.txt file in its folder, or from any text file where each line specifies the function address, name and arguments, separated by semi-colons; arguments are specified in type-name-size tuples whose elements are separated by commas. For example: ``` 800148b8;task_main_800148B8;int,param_1,4;int,param_2,1; ``` Arrays and pointers are specified as for data types
es_es: Las funciones se pueden importar de Ghidra mediante el script tools/ghidra_scripts/export_redux.py, el cual generará un archivo llamado redux_funcs.txt en su carpeta; o a partir de cualquier archivo de texto donde cada línea especifique la dirección de la función, su nombre y sus argumentos, todos ellos separados por puntos y coma. Los argumentos se deben especificar como tuplas tipo/nombre/tamaño y sus elementos deben estar separados por comas. Por ejemplo: ``` 800148b8;task_main_800148B8;int,param_1,4;int,param_2,1; ``` Las matrices y los punteros se especifican como tipos de datos «for»
uk: Імпорт функцій із Ghidra можливий за використання tools/ghidra_scripts/export_redux.py для генерації файлу redux_funcs.txt у теці чи з будь-якого текстового файлу, де кожен рядок указує адресу функції, ім'я й аргументи, розділені крапкою з комою; аргументи вказано в кортежах тип-ім'я-розмір, елементи яких розділено комами. Наприклад: ``` 800148b8;task_main_800148B8;int,param_1,4;int,param_2,1; ``` Масиви й указівники вказано як для типів даних.

source: Reimport data types from updated file
es_es: Reimportar tipos de datos de un archivo actualizado
pt_br: Re-importar tipos de dados do arquivo atualizado
uk: Переімпортувати типи даних із оновленого файлу

source: Reimport functions from updated file
es_es: Reimportar funciones de un archivo actualizado
pt_br: Re-importar funções do arquivo atualizado
uk: Переімпортувати функції з оновленого файлу

source: TypedDebuggerTabBar
uk: Панель вкладок налагоджувача типів

source: Watch
es_es: Inspección
pt_br: Observar
uk: Перегляд

source: Clear breakpoints
es_es: Eliminar puntos de interrupción
pt_br: Limpar pontos de interrupção
uk: Очистити точки зупинки

source: Restore disabled instructions
es_es: Restaurar instrucciones desactivadas
pt_br: Restaurar instruções desativadas
uk: Відновити вимкнені вказівки

source: WatchTable
pt_br: TabelaDeObservação
uk: Перегляд таблиці

source: Name
es_es: Nombre
pt_br: Nome
uk: Ім'я

source: Size
es_es: Tamaño
pt_br: Tamanho
uk: Розмір

source: Functions
es_es: Funciones
pt_br: Funções
uk: Функції

source: Clear log
es_es: Borrar registro
pt_br: Limpar o registro
uk: Очистити журнал

source: Restore disabled functions
es_es: Restaurar funciones desactivadas
pt_br: Restaurar funções desativadas
uk: Відновити вимкнені функції

source: FunctionBreakpoints
pt_br: PontosDeInterrupçãoDaFunção
uk: Точки зупинки функцій

source: {} (called from {} @ {:#x})##{}
es_es: {} (llamado por {} en {:#x})##{}
pt_br: {} (chamado de {} @ {:#x})##{}
uk: {} (викликано з {} @ {:#x})##{}

source: Toggle
es_es: Alternar
pt_br: Alternar
uk: Перемкнути

source: Add breakpoint##{}
es_es: Añadir punto de interrupción##{}
pt_br: Adicionar Ponto de Interrupção##{}
uk: Додати точку зупинки##{}

source: VRAM Shader Editor
es_es: Editor de shaders de la VRAM
pt_br: Editor de Shader da VRAM
uk: Редактор VRAM-шейдерів

source: View
es_es: Vista
pt_br: Visualizar
uk: Переглянути

source: Reset view
es_es: Restablecer vista
pt_br: Resetar a visualização
uk: Відновити вигляд

source: 24 bits shift
es_es: Variación para 24 bits
pt_br: Turno de 24 bits
uk: 24-бітний зсув

source: View VRAM in 24 bits
es_es: Ver la VRAM en el modo a 24 bits
pt_br: Visualizar a VRAM em 24 bits
uk: Переглянути VRAM у 24 біт

source: View VRAM in 16 bits
es_es: Ver la VRAM en el modo a 16 bits
pt_br: Visualizar a VRAM em 16 bits
uk: Переглянути VRAM у 16 біт

source: View VRAM in 8 bits
es_es: Ver la VRAM en el modo a 8 bits
pt_br: Visualizar a VRAM em 8 bits
uk: Переглянути VRAM у 8 біт

source: View VRAM in 4 bits
es_es: Ver la VRAM en el modo a 4 bits
pt_br: Visualizar a VRAM em 4 bits
uk: Переглянути VRAM у 4 біт

source: Select a CLUT
es_es: Seleccionar un CLUT
pt_br: Selecione uma CLUT
uk: Вибрати CLUT

source: Enable Alpha channel view
es_es: Mostrar canales alfa
pt_br: Ativar a visualização do canal Alpha
uk: Увімкнути перегляд альфа-каналу

source: Enable greyscale
es_es: Activar escala de grises
pt_br: Ativar escala de cinza
uk: Увімкнути відтінки сірого

source: Show grid
es_es: Mostrar cuadrícula
uk: Показати сітку

source: Select pixel grid color
es_es: Seleccionar color de cuadrícula de píxeles
uk: Вибрати колір піксельної сітки

source: Select TPage grid color
es_es: Seleccionar color de cuadrícula de TPage
uk: Вибрати колір TPage-сітки

source: Show Shader Editor
es_es: Mostrar editor de shaders
pt_br: Mostrar o Editor do Shader
uk: Показати редактор шейдерів

source: Select read highlight color
es_es: Seleccionar color de lecturas resaltadas
uk: Вибрати колір виділення читання

source: Select written highlight color
es_es: Seleccionar color de escrituras resaltadas
uk: Вибрати колір виділення запису

source: Read Highlight Color Picker
es_es: Selector de color de lecturas resaltadas
uk: Прочитане виділення підбірника кольору

source: Written Highlight Color Picker
es_es: Selector de color de escrituras resaltadas
uk: Записане виділення підбірника кольору

source: Pixel Grid Color Picker
es_es: Selector de color de cuadrícula de píxeles
uk: Вибір кольору піксельної сітки

source: TPage Grid Color Picker
es_es: Selector de color de cuadrícula de TPage
uk: Вибір кольору TPage-сітки

source: SPU configuration
es_es: Configuración de SPU
fr: Configuration du SPU
pt_br: Configuração do SPU
uk: Конфігурація SPU

source: Backend
es_es: Motor
uk: Серверна сторона

source: Device
es_es: Dispositivo
pt_br: Dispositivo
uk: Пристрій

source: Use Null Sync
es_es: Sincronización NULL
pt_br: Usar Sincronização Nula
uk: Використовувати нульову синхронізацію

source: More precise CPU-SPU synchronization, at the cost of extra power required.
es_es: Ofrece una sincronización entre CPU y SPU más precisa a costa de necesitar unos mayores requisitos de tu equipo.
pt_br: Sincronização da CPU-SPU mais precisa, ao custo da energia extra requerida.
uk: Більш точна синхронізація ЦП-СП за рахунок необхідної додаткової потужності.

source: Muted
es_es: Silenciar audio
fr: Muet
pt_br: Mudo
uk: Притлумлено

source: Enable streaming
es_es: Activar flujos de streaming
fr: Active le flux audio
pt_br: Ativar streaming
uk: Увімкнути потокову передачу

source: Uncheck this to mute the streaming channel from the main CPU to the SPU. This includes XA audio and audio tracks.
es_es: Desactiva esta opción para silenciar el canal del flujo que va de la CPU principal a la SPU. Incluye el audio XA y las pistas de audio.
fr: Décochez cette case pour couper le canal du flux audio du CPU principal vers le SPU. Cela inclut l'audio XA et les pistes audio.
pt_br: Desmarque isto pra silenciar o canal do streaming da CPU principal para o SPU. Isto inclui O XA Audio e as faixas de áudio.
uk: Зніми позначку для притлумлення потокового каналу від головного ЦП до СП. Сюди входять XA-аудіо й аудіодоріжки.

source: Loud
es_es: Alto
fr: Fort
pt_br: Alto
uk: Висока

source: Loudest
es_es: El más alto
fr: Très fort
pt_br: Mais Alto
uk: Найвища

source: Low
es_es: Bajo
fr: Faible
pt_br: Baixo
uk: Низька

source: Medium
es_es: Intermedio
fr: Moyen
pt_br: Médio
uk: Середня

source: Volume
es_es: Volumen
uk: Гучність

source: Attempts to make the CPU-to-SPU audio stream in sync, by changing its pitch. Consumes more CPU.
es_es: Intenta mantener en sincronía el flujo de audio entre la CPU y la SPU alterando su tono. Utiliza más la CPU.
fr: Tente de synchroniser le flux audio du CPU vers le SPU en modifiant sa hauteur. Consomme plus de CPU.
pt_br: Tentativas de fazer o fluxo de áudio da CPU-pro-SPU sincronizar mudando seu tom. Consome mais CPU.
uk: Спроба синхронізувати аудіопотік ЦП-СП зміною його висоти. Споживає більше ЦП.

source: Pause SPU waiting for CPU IRQ
es_es: SPU pausada a la espera de IRQs de CPU
fr: Suspendre le SPU en attendant l'IRQ du CPU
pt_br: Pausar o SPU aguardando a IRQ da CPU
uk: Призупинити СП очікуванням ЦП IRQ

source: Suspends the SPU processing during an IRQ, waiting for the main CPU to acknowledge it. Fixes issues with some games, but slows SPU processing.
es_es: Suspende el procesamiento de la SPU durante un IRQ hasta que la CPU principal la reconozca. Arregla problemas en algunos juegos a costa de frenar el procesamiento de la SPU.
fr: Suspend le traitement du SPU pendant un IRQ, en attendant que le CPU principal le reconnaisse. Corrige des problèmes avec certains jeux, mais ralentit le traitement du SPU.
pt_br: Suspende o processamento do SPU durante um IRQ esperando que a CPU principal o reconheça. Conserta problemas com alguns jogos mas desacelera o processamento do SPU.
uk: Призупинення опрацювання СП впродовж IRQ очікуванням підтвердження головного ЦП. Виправлення проблем деяких ігор при сповільненні опрацювання СП.

source: None - fastest
es_es: Ninguna - lo más rápido
fr: Sans - plus rapide
pt_br: Nenhum - mais rápido
uk: Не вказано - найшвидше

source: Simple - only handles the most common effects
es_es: Simple - aplica solo los efectos más comunes
fr: Simple - ne gère que les effets les plus courants
pt_br: Simples - só lida com os efeitos mais comuns
uk: Просто - опрацювання лише найпоширеніших ефектів

source: Accurate - best quality, but slower
es_es: Precisa: mejor calidad, pero más lenta
fr: Fidèle - meilleure qualité, mais plus lent
pt_br: Preciso - melhor qualidade mas mais lento
uk: Точно - найкраща якість, але повільніше

source: Reverb
es_es: Reverberación
fr: Réverbération
uk: Відлуння

source: Simple interpolation
es_es: Interpolación simple
fr: Interpolation simple
pt_br: Interpolação simples
uk: Проста інтерполяція

source: Gaussian interpolation - good quality
es_es: Interpolación gausiana - buena calidad
fr: Interpolation gaussienne - bonne qualité
pt_br: Interpolação gaussiana - qualidade boa
uk: Гаусівська інтерполяція - хороша якість

source: Cubic interpolation - better treble
es_es: Interpolación cúbica - mejores agudos
fr: Interpolation cubique - meilleurs aigus
pt_br: Interpolação cúbica - melhores agudos
uk: Кубічна інтерполяція - найкращі високі частоти

source: Interpolation
es_es: Interpolación
pt_br: Interpolação
uk: Інтерполяція

source: Mono
uk: Моно

source: Downmixes stereo to mono.
es_es: Reduce el sonido estéreo a mono.
fr: Flux audio en mono au lieu de stéréo.
pt_br: Fazer downmix do estéreo pro mono.
uk: Перетворення стерео до моно.

source: Capture/decode buffer IRQ
es_es: Capturar/Decodificar búfer de IRQ
pt_br: IRQ do buffer de captura/decodificação
uk: Буфер захоплення / декодування IRQ

source: Activates SPU IRQs based on writes to the decode/capture buffer. This option is necessary for some games.
es_es: Activa las IRQ de la SPU basadas en las escrituras al búfer de decodificación/captura. Esta opción es necesaria para algunos juegos.
pt_br: Ativa os IRQs do SPU baseado nas gravações no buffer de decodificação/captura. Esta opção é necessária pra alguns jogos.
uk: Активація СП IRQ на основі запису до буфера декодування / захоплення. Необхідно для деяких ігор.

source: SPU Debug
es_es: Depurador de SPU
pt_br: Debug do SPU
uk: СП-налагодження

source: {}x MSAA
es_es: MSAA x{}

source: CD-ROM ID: %.9s
es_es: ID de CD-ROM: %.9s
fr: ID du CD-ROM : %.9s
pt_br: ID do CD-ROM: %.9s

source: Pad 1
es_es: Mando 1

source: Pad 2
es_es: Mando 2

source: Pad
es_es: Mando

source: Slot {}
es_es: Ranura {}

source: UI
es_es: Interfaz de usuario
pt_br: Interface do Usuário

source: Ok
es_es: Aceptar

source: Hex
es_es: Hexadecimal

source: OK
es_es: Aceptar

source: {} @ {:#x}##{}
es_es: {} en {:#x}##{}

source: Select
pt_br: Selecionar

source: could not open: %s
fr: Impossible d'ouvrir : %s

source: Date & Time
fr: Date & Heure

source: File
fr: Fichier

source: Size
fr: Taille

source: (Untitled)
fr: (Sans titre)

source: Actual %i vs. %i estimated
fr: Actuel %i contre %i estimé

source: Add Breakpoint
fr: Ajouter un Breakpoint

source: Always enable SIO IRQ
fr: Toujours activer l'IRQ du SIO

source: BIOS Counters
fr: Compteurs du BIOS

source: Breakpoint Type
fr: Type de Breakpoint

source: Breakpoint on new syscalls
fr: Breakpoints sur de nouveaux syscalls

source: Buffer overflow...
fr: Dépassement de mémoire tampon...

source: Change streaming pitch
fr: Change le ton du flux audio

source: Cheats loaded from: %s
fr: Cheats chargés à partir de : %s

source: Cheats saved to: %s
fr: Cheats sauvegardés sur : %s

source: Close ISO
fr: Fermer l'ISO

source: Connection closed!
fr: Connexion coupée !

source: Could not allocate audio codec for the input, aborting
fr: Impossible d'allouer le codec audio à la source. Abandon.

source: Could not allocate frame
fr: Impossible d'allouer une trame.

source: Could not allocate memory to decode CDDA TRACK: %s
fr: Impossible d'allouer de la mémoire pour décoder la PISTE CDDA : %s

source: Could not find %s stream in input file
fr: Impossible de trouver le flux %s dans le fichier source

source: Could not find audio codec for the input, aborting
fr: Impossible de trouver le codec audio pour la source. Abandon.
