Repository: grumpycoders/pcsx-redux
Catalog: i18n/*.po
Languages: es_es, fr, pt_br, uk

source: MSAN system was already initialized.
es_es: El sistema MSAN ya ha sido iniciado.
uk: MSAN-систему визначено.

source: Out of memory in MsanAlloc
es_es: No queda memoria en MsanAlloc
uk: Недостатньо пам'яті в MsanAlloc.

source: Invalid pointer passed to MsanFree: %08x
es_es: Puntero no válido transmitido a MsanFree: %08x
uk: Передано недійсний указівник до MsanFree: %08x.

source: Invalid pointer passed to MsanRealloc: %08x
es_es: Puntero no válido transmitido a MsanRealloc: %08x
uk: Передано недійсний указівник до MsanRealloc: %08x.

source: Unregistered msan chain header at %08x
es_es: Cabecera de cadena msan sin registrar en %08x
uk: Незареєстрований заголовок MSAN-ланцюжка у %08x.

source: PCSX-Redux booting
es_es: Arrancando PCSX-Redux
fr: Démarrage de PCSX-Redux
pt_br: Inicialização do PCSX-Redux
uk: Завантаження PCSX-Redux.

source: Copyright (C) 2019-%i PCSX-Redux authors
es_es: Copyright (C) 2019-%i los autores de PCSX-Redux
uk: Автори PCSX-Redux, 2019-%i

source: CPU type: %s
es_es: Tipo de CPU: %s
uk: Тип ЦП: %s.

source: Wrong block number
es_es: Número de bloque erróneo
pt_br: Número do bloco errado
uk: Неправильний номер блоку.

source: SIO1 client disconnected
es_es: Cliente SIO1 desconectado
pt_br: Cliente SIO1 desconectado
uk: SIO1-клієнт роз'єднано.

source: SIO1 client connected
es_es: Cliente SIO1 conectado
pt_br: Cliente SIO1 conectado
uk: SIO1-клієнт з'єднано.

source: SIO1 TCP session closing due to unreliable connection. Restart SIO1 server/client and try again.
es_es: Sesión TCP del SIO1 cerrada por una conexión inestable. Reinicia el servidor o el cliente SIO1 y vuelve a intentarlo.
pt_br: A sessão do TCP SIO1 está fechando devido a conexão não confiável. Reinicie o servidor/cliente SIO1 e tente de novo.
uk: Сесію SIO1 TCP закрито через ненадійне з'єднання. Перезапусти SIO1-сервер / клієнт і спробуй знову.

source: Game-dependent dithering (slow)
es_es: Tramado según el juego (lento)
pt_br: Pontilhamento dependente do jogo (lento)
uk: Ігрозалежне згладжування (повільно)

source: No dithering (fastest)
es_es: Sin tramado (lo más rápido)
pt_br: Sem pontilhamento (mais rápido)
uk: Без згладжування (найшвидше)

source: Always dither g-shaded polygons (slowest)
es_es: Aplicar siempre tramado a polígonos con sombreado-g (lo más lento)
pt_br: Sempre atrasar polígonos g-shaded (mais lento)
uk: Завжди згладжувати Гуро-затемнені полігони (повільно)

source: Soft GPU configuration
es_es: Configuración de GPU por software
pt_br: Configuração leve da GPU
uk: Конфігурація Soft GPU

source: Dithering
es_es: Tramado
pt_br: Pontilhamento
uk: Згладжування

source: Use cached dithering tables
es_es: Utilizar tablas de tramado en caché
uk: Використовувати кешовані таблиці згладжування

source: Dithering tables are cached in memory for faster processing. Dithering will be done much faster, at the cost of a 512MB cache.
es_es: Las tablas de tramado se almacenan en una caché para procesarlas más rápidamente. El tramado funcionará mucho más rápido a costa de tener una caché de 512 MB.
uk: Таблиці згладжування кешовано в пам'яті для швидшого опрацювання. Згладжування буде виконано набагато швидше за рахунок 512 Мбайт кешу.

source: Disable textures for polygons
es_es: Desactivar texturas de polígonos
uk: Вимкнути текстури для полігонів

source: Disable textures for sprites
es_es: Desactivar texturas de sprites
uk: Вимкнути текстури для спрайтів

source: Soft GPU debugger
es_es: Depurador de GPU por software
pt_br: Debugger da GPU Leve
uk: Soft GPU-налагоджувач

source: Debugging features are not supported when using the software renderer yet Consider enabling the OpenGL GPU option instead.
es_es: Las opciones de depuración todavía no son compatibles con el renderizador por software. Deberías utilizar la opción de GPU OpenGL.
pt_br: As funções de debug ainda não são suportadas quando usar o renderizador de software Considere ativar a opção GPU do OpenGL ao invés disto.
uk: Функції налагодження ще не підтримувані при використанні програмного опрацьовувача. Натомість розглянь увімкнення опції ГП Open GL.

source: Open Disk Image
es_es: Abrir imagen de disco
pt_br: Abrir Imagem do Disco
uk: Відкрити образ диска

source: Open Binary
es_es: Abrir binario
pt_br: Abrir Binário
uk: Відкриття двійкового файлу

source: Open Archive
es_es: Abrir archivo
uk: Відкриття архіву

source: Select BIOS
es_es: Seleccionar BIOS
fr: Sélection du BIOS
pt_br: Selecionar BIOS
uk: Вибір BIOS

source: Select EXP1
es_es: Seleccionar EXP1
uk: Вибір EXP1

source: One argument needed to the setText* functions
es_es: Necesario un argumento para las funciones setText*
uk: Необхідно один аргумент для setText*-функцій.

source: The argument to the setText* functions need to be convertible to a string, or be a File object
es_es: El argumento de las funciones setText* debe ser convertible a una cadena de texto o ser un objeto de Archivo
uk: Аргумент для setText*-функцій необхідно конвертувати до рядка чи бути файлом.

source: Error compiling new shader code: {}
es_es: Error al compilar el código del shader nuevo: {}
uk: Помилка компіляції коду нового шейдера: {}.

source: Warning: OpenGL error reporting disabled. See About dialog for more information.
es_es: Aviso: se han desactivado los informes de errores de OpenGL. Para más información, ve a la ventana Acerca de.
pt_br: Aviso: Relatório de erros do OpenGL desativado. Veja a caixa de diálogo Sobre pra mais informações.
uk: Попередження: звітність помилок Open GL вимкнено. Докладні відомості у вікні "Про додаток".

source: Main VRAM Viewer
es_es: Visualizador de VRAM principal
pt_br: Visualizador da VRAM Principal
uk: Головний VRAM-переглядач

source: CLUT VRAM selector
es_es: Selector de CLUT de la VRAM
pt_br: Seletor da VRAM do CLUT
uk: CLUT VRAM-селектор

source: Vram Viewer #
es_es: Visualizador de VRAM
pt_br: Visualizador da Vram #
uk: VRAM-переглядач #

source: Memory Editor #
es_es: Editor de memoria
fr: Editeur de Mémoire #
pt_br: Editor de Memória #
uk: Редактор пам'яті #

source: Parallel Port
es_es: Puerto paralelo
fr: Port Parallèle
pt_br: Porta Paralela
uk: Паралельний порт

source: Scratch Pad
pt_br: Bloco de rascunho
uk: Блокнот

source: Hardware Registers
es_es: Registros de hardware
fr: Registres Matériel
pt_br: Registros do Hardware
uk: Апаратні регістри

source: Output
es_es: Salida
fr: Sortie
pt_br: Saída
uk: Вихід

source: File
es_es: Archivo
fr: Fichier
pt_br: Arquivo
uk: Файл

source: Close Disk Image
es_es: Cerrar imagen de disco
pt_br: Fechar Imagem do Disco
uk: Закрити образ диска

source: Load binary
es_es: Cargar binario
pt_br: Carregar binário
uk: Завантажити двійковий файл

source: Add Lua archive
es_es: Añadir archivo Lua
uk: Додати Lua-архів

source: Dump save state proto schema
es_es: Volcar protoesquema del guardado rápido
pt_br: Dumpar esquema proto do save state
uk: Дамп стану збереження схеми буферного протоколу

source: global{}
uk: глобально{}

source: Save state slots
es_es: Guardar un estado de guardado
pt_br: Slots do save state
uk: Слоти збереження станів

source: Quick-save slot
es_es: Ranura de guardado rápido
pt_br: Slot do salvamento rápido
uk: Слот швидкого збереження

source: Show named save states
es_es: Mostrar estados de guardado con nombres
uk: Показати імена збережених станів

source: Save global state
es_es: Guardar estado global
pt_br: Salvar o estado global
uk: Зберегти глобальний стан

source: Load state slots
es_es: Cargar un estado de guardado
pt_br: Carregar os slots do state
uk: Слоти завантаження станів

source: Quick-load slot
es_es: Ranura de carga rápida
uk: Слот швидкого завантаження

source: Load global state
es_es: Cargar estado global
pt_br: Carregar estado global
uk: Завантажити глобальний стан

source: Open LID
es_es: Abrir tapa de disco
fr: Ouvrir le CAPOT
pt_br: Abrir LID
uk: Відкрити LID

source: Close LID
es_es: Cerrar tapa de disco
fr: Fermer le CAPOT
pt_br: Fechar LID
uk: Закрити LID

source: Open and close LID
es_es: Abrir y volver a cerrar tapa de disco
fr: Ouvrir et refermer le CAPOT
pt_br: Abrir e fechar o LID
uk: Відкрити та закрити LID

source: Reboot
es_es: Reiniciar
pt_br: Reiniciar
uk: Перезавантажити

source: Quit
es_es: Salir
fr: Quitter
pt_br: Sair
uk: Вихід

source: Emulation
es_es: Emulación
pt_br: Emulação
uk: Емуляція

source: Start emulation
es_es: Iniciar emulación
pt_br: Iniciar emulação
uk: Розпочати емуляцію

source: Pause emulation
es_es: Pausar emulación
pt_br: Pausar Emulação
uk: Призупинити емуляцію

source: Soft Reset
es_es: Reinicio rápido
fr: Redémarrage du CPU
pt_br: Reset Leve
uk: Програмне перезавантаження

source: Hard Reset
es_es: Reinicio completo
fr: Bouton 'Reset'
pt_br: Reset Rígido
uk: Апаратне перезавантаження

source: Configuration
es_es: Configuración
pt_br: Configuração
uk: Конфігурація

source: Manage Memory Cards
es_es: Administrar tarjetas de memoria
pt_br: Gerenciar Cartões de Memória
uk: Керувати картами пам'яті

source: GPU
uk: ГП

source: SPU
uk: СП

source: System
es_es: Sistema
pt_br: Sistema
uk: Система

source: Controls
es_es: Controles
pt_br: Controles
uk: Керування

source: Shader presets
es_es: Preajustes de shaders
pt_br: Pré-definições do shader
uk: Шаблони шейдерів

source: Default shader
es_es: Shader predeterminado
pt_br: Shader padrão
uk: Типовий шейдер

source: CRT-lottes shader
es_es: Shader CRT-lottes
pt_br: Shader do CRT-Lottes
uk: CRT-lottes-шейдер

source: Configure Shaders
es_es: Configurar shaders
pt_br: Configurar Shaders
uk: Налаштувати шейдери

source: PIO Cartridge
es_es: Cartucho PIO
uk: PIO-картридж

source: Debug
es_es: Depurador
fr: Débug
uk: Налагодження

source: Show Logs
es_es: Mostrar registros
fr: Afficher les journaux
pt_br: Mostrar Registros
uk: Показати журнали

source: Show Lua Console
es_es: Mostrar consola Lua
pt_br: Mostrar o Console do Lua
uk: Показати Lua-консоль

source: Show Lua Inspector
es_es: Mostrar inspector de Lua
pt_br: Mostrar o Inspector do Lua
uk: Показати Lua-наглядач

source: Show Lua editor
es_es: Mostrar editor de Lua
pt_br: Mostrar o Editor do Lua
uk: Показати Lua-редактор

source: CPU
uk: ЦП

source: Show Registers
es_es: Mostrar registros
fr: Afficher les Registres
pt_br: Mostrar Registros
uk: Показати регістри

source: Show Assembly
es_es: Mostrar ensamblador
fr: Afficher l'Assembleur
pt_br: Mostrar Assembly
uk: Показати збір

source: Show DynaRec Disassembly
es_es: Mostrar desensamblador del DynaRec
pt_br: Mostrar o Disassembly do DynaRec
uk: Показати розбір динамічної перекомпіляції

source: DynaRec Disassembler is not available in Interpreted CPU mode. Try enabling [Dynarec CPU] in Configuration->Emulation, restart PCSX-Redux, then try again.
es_es: El desensamblador del DynaRec no se encuentra disponible en el modo de CPU interpretada. Prueba a activar [CPU DynaRec] dentro de Configuración->Emulación, reinicia PCSX-Redux y vuelve a intentarlo.
pt_br: O Disassembler do DynaRec não está disponível no modo de CPU interpretada. Tente ativar a [CPU do Dynarec] em Configuração->Emulação, reinicie o PCSX-Redux, então tente de novo.
uk: Розбірник динамічної перекомпіляції недоступний у режимі інтерпретованого ЦП. Спробуй увімкнути "Динамічна перекомпіляція ЦП" у Конфігурація → Емуляція, перезапусти PCSX-Redux, потім спробуй знову.

source: Show Breakpoints
es_es: Mostrar puntos de interrupción
fr: Afficher les Breakpoints
pt_br: Mostrar Pontos de Interrupção
uk: Показати точки зупинки

source: Show Callstacks
es_es: Mostrar pilas de llamadas
pt_br: Mostrar as Pilhas de Chamadas
uk: Показати стеки викликів

source: Memory Editors
es_es: Editores de memoria
fr: Editeurs de Mémoire
pt_br: Editores de Memória
uk: Редактори пам'яті

source: Show Memory Observer
es_es: Mostrar observador de memoria
pt_br: Mostrar o Observador da Memória
uk: Показати спостерігач пам'яті

source: Show Typed Debugger
es_es: Mostrar depurador con tipos
pt_br: Mostrar o Debug Digitado
uk: Показати налагоджувач типів

source: Show Patches
es_es: Mostrar parches
uk: Показати виправлення

source: Show Interrupts Scaler
es_es: Mostrar escalador de interrupciones
pt_br: Mostrar o Escalador das Interrupções
uk: Показати скалер переривань

source: First Chance Exceptions
es_es: Primeras excepciones
pt_br: Exceções de Primeira Chance
uk: Винятки першої можливості

source: VRAM viewers
es_es: Visualizadores de la VRAM
pt_br: Visualizadores da VRAM
uk: VRAM-переглядачі

source: Show main VRAM viewer
es_es: Mostrar visualizador de VRAM principal
pt_br: Mostrar o visualizador principal da VRAM
uk: Показати головний VRAM-переглядач

source: Show CLUT VRAM viewer
es_es: Mostrar selector de CLUT de la VRAM
pt_br: Mostrar o visualizador da VRAM do CLUT
uk: Показати CLUT VRAM-переглядач

source: Show VRAM viewer #
es_es: Mostrar visualizador de VRAM
pt_br: Mostrar o Visualizador da VRAM #
uk: Показати VRAM-переглядач #

source: Show GPU logger
es_es: Mostrar registro de GPU
uk: Показати ГП-реєстратор

source: Show GPU debug
es_es: Mostrar depurador de GPU
pt_br: Mostrar o Debug da GPU
uk: Показати ГП-налагодження

source: Show SPU debug
es_es: Mostrar depurador de SPU
fr: Afficher le debug du SPU
pt_br: Mostrar o Debug do SPU
uk: Показати СП-налагодження

source: Show Iso Browser
es_es: Mostrar explorador de ISO
uk: Показати ISO-браузер

source: Misc hardware
es_es: Otro hardware
uk: Інше обладнання

source: Show SIO1 debug
es_es: Mostrar depurador de SIO1
pt_br: Mostrar o Debug do SIO1
uk: Показати SIO1-налагодження

source: Kernel
uk: Ядро

source: Kernel Events
es_es: Eventos del kernel
pt_br: Eventos do Kernel
uk: Події ядра

source: Kernel Handlers
es_es: Controladores del kernel
pt_br: Manipuladores do Kernel
uk: Опрацьовувачі ядра

source: Kernel Calls
es_es: Llamadas al kernel
pt_br: Chamadas do Kernel
uk: Виклики ядра

source: Rendering
es_es: Renderizado
uk: Опрацювання

source: Full window render
es_es: Renderizar en toda la ventana
uk: Опрацьовувач повного вікна

source: Fullscreen
es_es: Pantalla completa
uk: Опрацьовувач повного екрана

source: Show Output Shader Editor
es_es: Mostrar editor de shaders de salida
pt_br: Mostrar o Editor de Saída do Shader
uk: Показати редактор кінцевих шейдерів

source: Show Offscreen Shader Editor
es_es: Mostrar editor de shaders fuera de pantalla
pt_br: Mostrar o Editor do Shader Fora da Tela
uk: Показати редактор позакадрових шейдерів

source: Reset shaders
es_es: Reiniciar shaders
uk: Відновити шейдери

source: Help
es_es: Ayuda
fr: Aide
pt_br: Ajuda
uk: Довідка

source: Show ImGui Demo
es_es: Mostrar demostración de ImGui
fr: Afficher la démo du ImGui
pt_br: Mostrar a Demo do ImGui
uk: Показати демонстрацію Im-Gui

source: Show UvFile information
es_es: Mostrar información de UvFile
pt_br: Mostrar Informações do Arquivo Uv
uk: Показати відомості Uv-File

source: About
es_es: Acerca de
fr: À propos de PCSX-Redux
pt_br: Sobre
uk: Про додаток

source: CPU: %s
uk: ЦП: %s

source: GAME ID: %s
es_es: ID de juego: %s
pt_br: ID DO JOGO: %s
uk: ID гри: %s

source: %.2f FPS (%.2f ms)
uk: %.3f Гц (%.3f мсек)

source: %.2f ms audio buffer (%i frames)
es_es: Búfer de audio de %.2f ms (%i fotogramas)
pt_br: %.2f buffer do áudio em ms (%i frames)
uk: %.3f мсек аудіобуфер (%i кадрів)

source: Idle
es_es: Inactivo
pt_br: Inativo
uk: Неактивний

source: Logs
es_es: Registros
fr: Journaux
pt_br: Registros
uk: Журнали

source: Lua Console
es_es: Consola Lua
pt_br: Console do Lua
uk: Lua-консоль

source: Lua Inspector
es_es: Inspector de Lua
pt_br: Inspetor do Lua
uk: Lua-спостерігач

source: Lua Editor
es_es: Editor de Lua
pt_br: Editor do Lua
uk: Lua-редактор

source: Kernel events
es_es: Eventos del kernel
pt_br: Eventos do Kernel
uk: Події ядра

source: Kernel handlers
es_es: Controladores del kernel
pt_br: Manipuladores do Kernel
uk: Опрацьовувачі ядра

source: Callstacks
es_es: Pilas de llamadas
pt_br: Pilhas de Chamadas
uk: Стеки викликів

source: Memory Card Manager
es_es: Administrador de tarjetas de memoria
pt_br: Gerenciador do Memory Card
uk: Менеджер карт пам'яті

source: Registers
es_es: Registros
fr: Registres
pt_br: Registros
uk: Регістри

source: Assembly
es_es: Ensamblador
fr: Assembleur
uk: Збір

source: DynaRec Disassembler
es_es: Desensamblador del DynaRec
pt_br: Disassembler do DynaRec
uk: Розбірник динамічної перекомпіляції

source: Breakpoints
es_es: Puntos de interrupción
pt_br: Pontos de Interrupção
uk: Точки зупинки

source: Patches
es_es: Parches
uk: Виправлення

source: Named Save States
es_es: Estados de guardado con nombres
uk: Імена збережених станів

source: Memory Observer
es_es: Observador de memoria
pt_br: Observador de Memória
uk: Спостерігач пам'яті

source: Typed Debugger
es_es: Depurador con tipos
pt_br: Debugger Digitado
uk: Налагоджувач типів

source: Output Video
es_es: Salida de vídeo
pt_br: Saída de Vídeo
uk: Кінцеве відео

source: Offscreen Render
es_es: Renderizado de elementos fuera de pantalla
pt_br: Renderização Fora da Tela
uk: Позакадрове опрацювання

source: PIO Cartridge Configuration
es_es: Configuración del cartucho PIO
uk: Конфігурація PIO-картриджа

source: SIO1 Debug
es_es: Depurador de SIO1
pt_br: Debug do SIO1
uk: SIO1-налагодження

source: ISO Browser
es_es: Explorador de ISO
uk: ISO-браузер

source: GPU Logger
es_es: Registro de GPU
uk: ГП-реєстратор

source: UI Configuration
es_es: Configuración de la interfaz de usuario
pt_br: Configuração da Interface do Usuário
uk: Конфігурація UI

source: Locale
es_es: Idioma
fr: Langue
pt_br: Idioma
uk: Мова

source: Reload locales
es_es: Volver a cargar idiomas
fr: Recharger les langues
pt_br: Recarregar os idiomas
uk: Перезавантажити мови

source: Main Font Size
es_es: Tamaño de la fuente principal
pt_br: Tamanho da Fonte Principal
uk: Розмір головного шрифту

source: Mono Font Size
es_es: Tamaño de la fuente monoespaciada
pt_br: Tamanho da Fonte Mono
uk: Розмір моношрифту

source: Use Widescreen Aspect Ratio
es_es: Usar relación de aspecto panorámica
pt_br: Usar a Proporção do Aspecto Widescreen
uk: Використовувати широкоекранне співвідношення сторін

source: Sets the output screen ratio to 16:9 instead of 4:3. Note that this setting is NOT the popular hack to force games into widescreen mode, but rather an emulation of the fact users could change their TV sets to be in 16:9 mode instead of 4:3. Some games have a "wide screen" rendering setting, which changes the rendering of the game accordingly, and requires the user to change the settings of their TV set to match the aspect ratio of the game.
es_es: Establece la relación de aspecto de la salida de imagen a 16:9, en vez de usar 4:3. Ten en cuenta que este ajuste NO ES el famoso arreglo que fuerza a los juegos a mostrarse en formato panorámico, sino una emulación de la acción que podían realizar los usuarios de cambiar sus televisores para mostrar un modo a 16:9, en vez del modo a 4:3. Algunos juegos pueden renderizarse de forma nativa en formato panorámico, lo que cambia el renderizado y espera que el usuario cambie la configuración de su televisor para que coincida con la relación de aspecto del juego.
pt_br: Define a saída da proporção da tela em 16:9 ao invés de 4:3. Note que esta configuração NÃO é o hack popular pra forçar os jogos no modo widescreen mas ao invés disto uma emulação do fato de que os usuários poderiam mudar as definições das TVs deles pra que estejam no modo 16:9 ao invés de 4:3. Alguns jogos têm uma configuração de renderização "wide screen" a qual muda a renderização do jogo de acordo e requer que o usuário mude as configurações do conjunto de TV dele pra combinar com a proporção do aspecto do jogo.
uk: Встановлення кінцевого співвідношення екрана на 16:9 замість 4:3. Зауваж, налаштування - НЕ популярний хак для переведення ігор до широкого екрана, а імітація зміни користувачами телевізорів на режим 16:9 замість 4:3. Деякі ігри мають налаштування візуалізації "Широкий екран" для зміни опрацювання гри та вимагають від користувача зміни налаштувань телевізора для збіжності зі співвідношеннями сторін гри.

source: System Configuration
es_es: Configuración del sistema
pt_br: Configuração do Sistema
uk: Конфігурація системи

source: Preload Disk Image files
es_es: Precargar imágenes de disco
pt_br: Pré-Carregar os Arquivos de Imagem do Disco
uk: Попереднє завантаження файлів образу диска

source: Enable Auto Update
es_es: Activar actualizaciones automáticas
pt_br: Ativar a Auto-Atualização
uk: Увімкнути автооновлення

source: Update configuration
es_es: Configuración de actualizaciones
pt_br: Atualizar Configurações
uk: Конфігурація оновлень

source: PCSX-Redux can automatically update itself. If you enable the auto update option, it will check for new updates on startup. No personal data nor identifiable token is sent for this process, but Microsoft might still keep and record information such as your IP address. If an update is available, you will get prompted to download and install it. You can still download versions of PCSX-Redux as usual from its website. If you want to change this setting later, you can go to the Configuration -> System menu.
es_es: PCSX-Redux puede actualizarse de forma automática. Si activas la opción de actualizaciones automáticas, el programa buscará versiones nuevas nada más ejecutarse. No se enviarán datos personales ni tokens identificables durante este proceso, pero Microsoft podría almacenar cierta información, como tu dirección IP. En caso de que haya una actualización disponible, se te preguntará si quieres descargarla e instalarla. También puedes seguir descargándote las versiones de PCSX-Redux desde su página web, como siempre. Si quieres cambiar este ajuste más tarde, puedes hacerlo en el menú Configuración -> Sistema.
pt_br: O PCSX-Redux pode automaticamente atualizar a si mesmo. Se você ativar a opção de auto-atualização ela procurará novas atualizações na inicialização. Nenhum dado pessoal ou código identificável é enviado pra isto mas a Microsoft ainda poderia manter e registrar informações tais como seu endereço de IP. Se uma atualização estiver disponível você será alertado a baixá-la e instalá-la. Você ainda pode baixar versões do PCSX-Redux como de costume do seu site da web. Se você quer mudar esta configuração mais tarde você pode ir em Configuração -> Menu do Sistema.
uk: PCSX-Redux може автоматично оновлюватись. Буде перевірено нові оновлення при запуску. Жодні особисті дані чи ідентифікаційний маркер не буде надіслано, але Microsoft усе одно може зберігати та записувати відомості як IP-адресу. При доступному оновленні буде запропоновано завантажити та встановити. Ти ще можеш звичайно завантажувати версії PCSX-Redux із web-сайту. Для зміни налаштування пізніше можна перейти до Конфігурація → Системне меню.

source: Enable auto update
es_es: Activar actualizaciones automáticas
pt_br: Ativar a auto-atualização
uk: Увімкнути автооновлення

source: No thanks
es_es: No, gracias
pt_br: Não, obrigado
uk: Ні, дякую

source: Update available
es_es: Actualización disponible
pt_br: Atualização disponível
uk: Доступне оновлення

source: An update is available. Click 'Update' to download and apply the update. PCSX-Redux will automatically restart to apply it. Click 'Download' to use your browser to download the update and manually apply it.
es_es: Hay una actualización disponible. Pulsa en «Actualizar» para descargarla y aplicarla. PCSX-Redux se reiniciará automáticamente para aplicar dicha actualización. Pulsa en «Descargar» para obtener la actualización con tu navegador web y aplicarla manualmente.
pt_br: Uma atualização está disponível. Clique em 'Download' pra baixar e aplicar a atualização. O PCSX-Redux será reiniciado automaticamente pra aplicá-la. Clique em "Download" pra usar seu navegador pra baixar a atualização e aplicá-la manualmente.
uk: Оновлення доступне. Натисни "Оновити" для завантаження та встановлення. PCSX-Redux буде автоматично перезапущено. Натисни "Завантажити" для завантаження оновлення з браузера та ручного встановлення.
